local record_dungeon_chapter_info = {}

record_dungeon_chapter_info.id = 0 --章节ID
record_dungeon_chapter_info.name = "" --章节名称
record_dungeon_chapter_info.premise_id = 0 --前置章节
record_dungeon_chapter_info.level = 0 --等级限制
record_dungeon_chapter_info.star = 0 --章节总星数
record_dungeon_chapter_info.image = 0 --城池icon
record_dungeon_chapter_info.map = 0 --地图资源链接
record_dungeon_chapter_info.copy_pic = 0 --章节入口图
record_dungeon_chapter_info.copperbox_star = 0 --铜宝箱所需星数
record_dungeon_chapter_info.silverbox_star = 0 --银宝箱所需星数
record_dungeon_chapter_info.goldbox_star = 0 --金宝箱所需星数
record_dungeon_chapter_info.copperbox_id = 0 --铜宝箱掉落库ID
record_dungeon_chapter_info.silverbox_id = 0 --银宝箱掉落库ID
record_dungeon_chapter_info.goldbox_id = 0 --金宝箱掉落库ID
record_dungeon_chapter_info.direction = "" --字幕描述
record_dungeon_chapter_info.story_id = 0 --英雄传id


dungeon_chapter_info = {
    _data = {
    [1] = {1,"一击男",0,1,15,9,11,11,10,13,15,23000,23002,23003,"新人进入一拳超人的世界，开始体验英雄活动与冒险……",0,},
    [2] = {2,"螃蟹怪人",1,1,18,7,12,12,6,12,18,23001,23002,23003,"路见不平，勇救小孩，打败螃蟹怪人……",0,},
    [3] = {3,"机械人和蚊女",2,1,18,6,13,13,6,12,18,23004,23005,23006,"遇见半机械人杰诺斯，与他一起打败了吸血的蚊子女王……",0,},
    [4] = {4,"进化之家",3,1,24,3,14,6,8,16,24,23004,23005,23006,"发现进化之家消灭人类的阴谋，打败了博士及其手下的改造怪物……",0,},
    [5] = {5,"桃源团",4,1,30,5,5,5,10,20,30,23007,23008,23009,"碰见四处破坏的桃源团，教育了他们，让他们改邪归正了……",0,},
    [6] = {6,"英雄考试及活动",5,1,30,8,3,3,10,20,30,23007,23008,23009,"参加英雄协会的认定考试，还打败了偷袭的蛇咬拳……",0,},
    [7] = {7,"夏天的回忆",6,1,30,5,4,4,10,20,30,23010,23011,23012,"灾害来袭，与其他英雄一起平息了十七万年蝉的灾害……",0,},
    [8] = {8,"幽灵都市传说",7,1,30,7,7,7,10,20,30,23010,23011,23012,"居住在废弃的城市，使该地区变成了传说中的鬼城……",1,},
    [9] = {9,"巨大陨石",8,1,30,8,8,8,10,20,30,23013,23014,23015,"龙级灾害的陨石向地球飞来，被英雄们成功破坏了……",2,},
    [10] = {10,"谣言和小猪银行",9,1,30,8,5,5,10,20,30,23013,23014,23015,"被其他无能的家伙嫉妒，但是打破了谣言……",3,},
    [11] = {11,"深海之王上",10,1,30,5,4,4,10,20,30,23016,23017,23018,"深海一族来袭，深海之王太强大了，击败了好几位英雄……",4,},
    [12] = {12,"深海之王下",11,1,30,5,10,10,10,20,30,23016,23017,23018,"深海之王进入避难所，准备大开杀戒之时，被英雄们阻止并击败了……",5,},
    [13] = {13,"孤独的午餐",12,1,30,5,5,5,10,20,30,23019,23020,23021,"在楼顶吃午餐时，拯救了跳楼的大叔，并使其重新振作起来……",6,},
    [14] = {14,"奇袭梅怪人",13,1,30,8,6,6,10,20,30,23019,23020,23021,"帮助警察们抵御了前来袭击的奇袭梅怪人……",7,},
    [15] = {15,"猫怪古力斯尼亚",14,1,30,8,7,7,10,20,30,23022,23023,23024,"历尽千辛万苦，打败了四处破坏的猫怪……",8,},
    [16] = {16,"A级赏金犯牛牛",15,1,30,8,3,3,10,20,30,23022,23023,23024,"A级通缉犯抢劫银行，英雄英勇追击并将他们逮捕了……",9,},
    [17] = {17,"地底之王",16,1,30,3,10,10,10,20,30,23025,23026,23027,"地底之王带领地底人入侵地上，英雄们出动将他们打败了……",10,},
    [18] = {18,"天空之王",17,1,30,2,3,3,10,20,30,23025,23026,23027,"天空之王带领族人袭击英雄协会，英雄们出动！",11,},
    [19] = {19,"吹雪组",18,1,30,2,1,1,10,20,30,23028,23029,23030,"成功进阶到B级英雄，吹雪组上门来找麻烦了……",12,},
    [20] = {20,"甜心假面",19,1,30,7,4,4,10,20,30,23028,23029,23030,"A级第一位的英雄甜心假面，据说他的实力远远超过A级！",13,},
    [21] = {21,"性感囚犯",20,1,30,5,3,3,10,20,30,23031,23032,23033,"因为最近太受欢迎被基佬性感囚犯看上，该高兴吗？",14,},
    [22] = {22,"背心尊者",21,1,30,5,1,1,10,20,30,23031,23032,23033,"与S级英雄背心尊者和他手下的背心小弟们切磋，实力大有长进……",15,},
    [23] = {23,"风扇怪人",22,1,30,9,6,6,10,20,30,23034,23035,23036,"与吹雪组一起出动，对付了灾害风扇怪人……",16,},
    [24] = {24,"银色獠牙",23,1,30,2,1,1,10,20,30,23034,23035,23036,"S级英雄银色獠牙，是一位德高望重的武术大师，这次得到了他的指点。",17,},
    [25] = {25,"金属球棒",24,1,30,2,5,5,10,20,30,23037,23038,23039,"S级英雄金属球棒，是一位超级热血的男子，但同时他又是一位非常疼爱妹妹的哥哥……",18,},
    [26] = {26,"十七万年蝉",25,1,30,1,8,8,10,20,30,23037,23038,23039,"再一次与其他英雄们消灭了十七万年蝉……",19,},
    [27] = {27,"居合钢",26,1,30,2,10,10,10,20,30,23040,23041,23042,"A级英雄居合钢，是原子武士的弟子……",20,},
    [28] = {28,"原子武士",27,1,30,2,1,1,10,20,30,23040,23041,23042,"S级英雄原子武士，虽然打扮过时，但实力却是一流的。",21,},
    [29] = {29,"小龙卷",28,1,30,3,7,7,10,20,30,23043,23044,23045,"超能力者小龙卷，S级英雄，无与伦比的强大，就是性格有点差……",22,},
    [30] = {30,"三王来袭",29,1,30,3,8,8,10,20,30,23043,23044,23045,"这一次地底王，深海王，天空王联合来袭，英雄们团结一致，终于保卫了家园……",23,},
    [31] = {31,"英雄协会会议",30,1,30,6,6,6,10,20,30,23046,23047,23048,"英雄协会召开会议，发布了“地球要危险了”的大预言……",24,},
    [32] = {32,"外星人入侵上",31,1,30,9,8,8,10,20,30,23046,23047,23048,"宇宙飞船降临A市，破坏了整个城市，只有英雄协会建筑大楼得以幸免……",25,},
    [33] = {33,"外星人入侵中",32,1,30,2,10,10,10,20,30,23049,23050,23051,"打败了宇宙飞船里的三大战斗员中的梅而紫迦德,又打败了格洛里巴斯……",26,},
    [34] = {34,"外星人入侵下",33,1,30,2,8,8,10,20,30,23049,23050,23051,"进入宇宙飞船，打败了号称宇宙第一的念动力大师：格鲁甘修鲁……",27,},
    [35] = {35,"外星王波罗斯",34,1,30,9,6,6,10,20,30,23052,23053,23054,"与外星王波罗斯对决，发挥出认真的实力后，终于将其打败……",28,},
    [36] = {36,"最强男人传说",35,1,30,9,5,5,10,20,30,23052,23053,23054,"结交号称地上最强的男人:KING,发现他是个游戏爱好者，一起愉快的打游戏吧（笑）",29,},
    [37] = {37,"迷路猫咪",36,1,30,9,4,4,10,20,30,23055,23056,23057,"接受英雄协会的特殊委托，找到了小萝莉丢失的猫咪……",30,},
    [38] = {38,"龙虾火锅",37,1,30,2,1,1,10,20,30,23055,23056,23057,"邦古老师请大家吃龙虾大餐，大家顺便帮他处理了前来踢馆的坏人……",31,},
    [39] = {39,"想当怪人的男人",38,1,30,2,7,7,10,20,30,23058,23059,23060,"叛出流水岩碎流的男人饿狼，走上了怪人的道路，不知以后会怎么样……",32,},
    [40] = {40,"蜈蚣长老",39,1,30,2,8,8,10,20,30,23058,23059,23060,"蜈蚣长老带领怪人们袭击都市，与金属球棒一起，用气势赶跑了他们……",33,},
    [41] = {41,"制服大赛",40,1,30,9,3,3,10,20,30,23061,23062,23063,"参加了制服选拔大赛，顺便赶跑了前来捣乱的龟龟柏洛斯……",34,},
    [42] = {42,"金属球棒",41,1,30,9,7,7,10,20,30,23061,23062,23063,"与金属球棒切磋，学会了在气势上超越对手，实力大涨！",35,},
    [43] = {43,"丑女人面具",42,1,30,9,5,5,10,20,30,23064,23065,23066,"童帝发明了丑女人面具，可以用来查看他人的实力，真是个有趣的玩意……",36,},
    [44] = {44,"魔鬼改造人",43,1,30,4,6,6,10,20,30,23064,23065,23066,"杰诺斯君在S级排位又上升了，我们去恭喜他……",37,},
    [45] = {45,"性感囚犯",44,1,30,5,4,4,10,20,30,23067,23068,23069,"性感囚犯虽然是基佬，但却是一个正直勇敢的基佬……",38,},
    [46] = {46,"机神G4",45,1,30,4,7,7,10,20,30,23067,23068,23069,"机神G4获得任务，前来刺杀KING,但被英雄们遇到并打败，任务失败……",39,},
    [47] = {47,"背心尊者的训练",46,1,30,2,10,10,10,20,30,23070,23071,23072,"背心尊者只相信肌肉的力量，每日重复大量的训练，我们也与他一起吧！",40,},
    [48] = {48,"闪光弗莱士",47,1,30,2,1,1,10,20,30,23070,23071,23072,"S级英雄闪光弗莱士，外表虽然娘，但实力很强大……",41,},
    [49] = {49,"警犬侠的追踪",48,1,30,1,5,5,10,20,30,23073,23074,23075,"警犬侠说：汪汪汪……",42,},
    [50] = {50,"闪亮的黑光",49,1,30,6,3,3,10,20,30,23073,23074,23075,"S级英雄超合金黑光，又是一位肌肉男，他的身体闪烁着耀眼的光芒……（眼已瞎）",43,},
    [51] = {51,"贪吃的猪神",50,1,30,8,4,4,10,20,30,23076,23077,23078,"外表虽然是贪吃的宅男，但猪神却有作为S级英雄的实力……",44,},
    [52] = {52,"驱动骑士",51,1,30,6,6,6,10,20,30,23076,23077,23078,"神秘的驱动骑士，似乎和金属骑士有说不清的关系，这一次得到他的提醒……",45,},
    [53] = {53,"僵尸男",52,1,30,3,10,10,10,20,30,23079,23080,23081,"S级英雄僵尸男，有着超强的回复能力，据说是不死的……",46,},
    [54] = {54,"KING的传说",53,1,30,3,7,7,10,20,30,23079,23080,23081,"KING君其实是个普通人，但是有超强的运势啊，每次都是琦玉老师出现帮他解决怪人……",47,},
    [55] = {55,"金属骑士",54,1,30,3,6,6,10,20,30,23082,23083,23084,"金属骑士其实是远程遥控的机器人，似乎在其身后有另外一股势力……",48,},
    [56] = {56,"天才童帝",55,1,30,5,3,3,10,20,30,23082,23083,23084,"天才小学生童帝，之前是某位博士的助手，现在成为了S级的英雄。",49,},
    [57] = {57,"传奇的武士",56,1,30,5,8,8,10,20,30,23085,23086,23087,"与原子武士切磋，实力得到了长进……",50,},
    [58] = {58,"银色獠牙",57,1,30,5,1,1,10,20,30,23085,23086,23087,"拜访流水岩碎流的邦古老师，并与他的弟子一起交流了一番……",51,},
    [59] = {59,"战栗的龙卷风",58,1,30,9,7,7,10,20,30,23088,23089,23090,"任性的小龙卷，但她的超能力却无比强大，是个难对付的家伙……",52,},
    [60] = {60,"一拳的较量",59,1,30,1,10,10,10,20,30,23088,23089,23090,"与最强的英雄琦玉较量，如果能让他稍微认真点，就算赢了……",53,},
    [61] = {61,"正义的无证骑士",60,200,30,1,5,5,10,20,30,23091,23092,23093,"打败了新出现的怪人，这边迎接下一场挑战……",54,},
    [62] = {62,"坚硬的钉锤头",61,1,30,8,4,4,10,20,30,23091,23092,23093,"打败了新出现的怪人，这边迎接下一场挑战……",55,},
    [63] = {63,"吓尿的大背头侠",62,1,30,5,8,8,10,20,30,23094,23095,23096,"打败了新出现的怪人，这边迎接下一场挑战……",56,},
    [64] = {64,"锋利的海带",63,1,30,5,7,7,10,20,30,23094,23095,23096,"打败了新出现的怪人，这边迎接下一场挑战……",57,},
    [65] = {65,"暴走的阿修罗",64,1,30,2,10,10,10,20,30,23097,23098,23099,"打败了新出现的怪人，这边迎接下一场挑战……",58,},
    [66] = {66,"雷光贤治",65,1,30,1,6,6,10,20,30,23097,23098,23099,"打败了新出现的怪人，这边迎接下一场挑战……",59,},
    [67] = {67,"海比空格",66,1,30,1,3,3,10,20,30,23100,23101,23102,"打败了新出现的怪人，这边迎接下一场挑战……",60,},
    [68] = {68,"偷袭的蛇咬拳",67,1,30,9,7,7,10,20,30,23100,23101,23102,"打败了新出现的怪人，这边迎接下一场挑战……",61,},
    [69] = {69,"与闪电侠切磋",68,1,30,9,1,1,10,20,30,23103,23104,23105,"打败了新出现的怪人，这边迎接下一场挑战……",62,},
    [70] = {70,"超人气毒刺",69,1,30,9,3,3,10,20,30,23103,23104,23105,"打败了新出现的怪人，这边迎接下一场挑战……",63,},
    [71] = {71,"魔术妙手",70,1,30,2,5,5,10,20,30,23106,23107,23108,"打败了新出现的怪人，这边迎接下一场挑战……",64,},
    [72] = {72,"大哲人的哲学",71,1,30,2,3,3,10,20,30,23106,23107,23108,"打败了新出现的怪人，这边迎接下一场挑战……",65,},
    [73] = {73,"喝酒的黄金球",72,1,30,2,7,7,10,20,30,23109,23110,23111,"打败了新出现的怪人，这边迎接下一场挑战……",66,},
    [74] = {74,"巴涅西凯的剑",73,1,30,6,7,7,10,20,30,23109,23110,23111,"打败了新出现的怪人，这边迎接下一场挑战……",67,},
    [75] = {75,"青焰的秘密",74,1,30,6,10,10,10,20,30,23112,23113,23114,"打败了新出现的怪人，这边迎接下一场挑战……",68,},
    [76] = {76,"忍者村的忍者",75,1,30,6,3,3,10,20,30,23112,23113,23114,"打败了新出现的怪人，这边迎接下一场挑战……",69,},
    [77] = {77,"重战车兜裆布",76,1,30,8,10,10,10,20,30,23115,23116,23117,"打败了新出现的怪人，这边迎接下一场挑战……",70,},
    [78] = {78,"钻头武士",77,1,30,8,1,1,10,20,30,23115,23116,23117,"打败了新出现的怪人，这边迎接下一场挑战……",71,},
    [79] = {79,"飞舞的太刀",78,1,30,8,3,3,10,20,30,23118,23119,23120,"打败了新出现的怪人，这边迎接下一场挑战……",72,},
    [80] = {80,"剑士居合钢",79,1,30,5,4,4,10,20,30,23118,23119,23120,"打败了新出现的怪人，这边迎接下一场挑战……",73,},
    [81] = {81,"甜心大帅哥",80,1,30,8,5,5,10,20,30,23121,23122,23123,"打败了新出现的怪人，这边迎接下一场挑战……",74,},
    [82] = {82,"穿西装的乌马洪",81,1,30,9,6,6,10,20,30,23121,23122,23123,"打败了新出现的怪人，这边迎接下一场挑战……",75,},
    [83] = {83,"吹雪女王",82,1,30,7,7,7,10,20,30,23124,23125,23126,"打败了新出现的怪人，这边迎接下一场挑战……",76,},
    [84] = {84,"超大巨人",83,1,30,7,8,8,10,20,30,23124,23125,23126,"打败了新出现的怪人，这边迎接下一场挑战……",77,},
    [85] = {85,"吸血蚊女王",84,1,30,7,10,10,10,20,30,23127,23128,23129,"打败了新出现的怪人，这边迎接下一场挑战……",78,},
    [86] = {86,"游戏比赛",85,1,30,1,1,1,10,20,30,23127,23128,23129,"打败了新出现的怪人，这边迎接下一场挑战……",79,},
    [87] = {87,"十字键",86,1,30,3,3,3,10,20,30,23130,23131,23132,"打败了新出现的怪人，这边迎接下一场挑战……",80,},
    [88] = {88,"丧服吊带",87,1,30,3,4,4,10,20,30,23130,23131,23132,"打败了新出现的怪人，这边迎接下一场挑战……",81,},
    [89] = {89,"背心集团",88,1,30,2,5,5,10,20,30,23133,23134,23135,"打败了新出现的怪人，这边迎接下一场挑战……",82,},
    [90] = {90,"吹雪组打工",89,1,30,8,6,6,10,20,30,23133,23134,23135,"打败了新出现的怪人，这边迎接下一场挑战……",83,},
    [91] = {91,"银行劫匪",90,1,30,8,7,7,10,20,30,23136,23137,23138,"打败了新出现的怪人，这边迎接下一场挑战……",84,},
    [92] = {92,"桃源团活动",91,1,30,5,8,8,10,20,30,23136,23137,23138,"打败了新出现的怪人，这边迎接下一场挑战……",85,},
    [93] = {93,"进化怪物大战",92,1,30,5,10,10,10,20,30,23139,23140,23141,"打败了新出现的怪人，这边迎接下一场挑战……",86,},
    [94] = {94,"猫怪古力斯尼亚",93,1,30,5,1,1,10,20,30,23139,23140,23141,"打败了新出现的怪人，这边迎接下一场挑战……",87,},
    [95] = {95,"深海一族",94,1,30,3,3,3,10,20,30,23142,23143,23144,"打败了新出现的怪人，这边迎接下一场挑战……",88,},
    [96] = {96,"地底一族",95,1,30,3,4,4,10,20,30,23142,23143,23144,"打败了新出现的怪人，这边迎接下一场挑战……",89,},
    [97] = {97,"天空一族",96,1,30,3,5,5,10,20,30,23145,23146,23147,"打败了新出现的怪人，这边迎接下一场挑战……",90,},
    [98] = {98,"超级大蜈蚣",97,1,30,6,6,6,10,20,30,23145,23146,23147,"打败了新出现的怪人，这边迎接下一场挑战……",91,},
    [99] = {99,"大战波罗斯",98,1,30,6,7,7,10,20,30,23148,23149,23150,"打败了新出现的怪人，这边迎接下一场挑战……",92,},
    [100] = {100,"琦玉老师",99,1,30,2,8,8,10,20,30,23148,23149,23150,"打败了新出现的怪人，这边迎接下一场挑战……",93,},
    [101] = {101,"一击男",100,1,30,5,10,10,10,20,30,23151,23152,23153,"打败了新出现的怪人，这边迎接下一场挑战……",94,},
    [102] = {102,"螃蟹怪人",101,1,30,8,1,1,10,20,30,23151,23152,23153,"打败了新出现的怪人，这边迎接下一场挑战……",95,},
    [103] = {103,"机械人和蚊女",102,1,30,4,3,3,10,20,30,23154,23155,23156,"打败了新出现的怪人，这边迎接下一场挑战……",96,},
    [104] = {104,"进化之家",103,1,30,3,4,4,10,20,30,23154,23155,23156,"打败了新出现的怪人，这边迎接下一场挑战……",97,},
    [105] = {105,"桃源团",104,1,30,6,5,5,10,20,30,23157,23158,23159,"打败了新出现的怪人，这边迎接下一场挑战……",98,},
    [106] = {106,"英雄考试及活动",105,1,30,6,6,6,10,20,30,23157,23158,23159,"打败了新出现的怪人，这边迎接下一场挑战……",99,},
    [107] = {107,"夏天的回忆",106,1,30,2,7,7,10,20,30,23160,23161,23162,"打败了新出现的怪人，这边迎接下一场挑战……",100,},
    [108] = {108,"幽灵都市传说",107,1,30,5,8,8,10,20,30,23160,23161,23162,"打败了新出现的怪人，这边迎接下一场挑战……",101,},
    [109] = {109,"巨大陨石",108,1,30,5,10,10,10,20,30,23163,23164,23165,"打败了新出现的怪人，这边迎接下一场挑战……",102,},
    [110] = {110,"谣言和小猪银行",109,1,30,1,1,1,10,20,30,23163,23164,23165,"打败了新出现的怪人，这边迎接下一场挑战……",103,},
    [111] = {111,"深海之王上",110,1,30,4,3,3,10,20,30,23166,23167,23168,"打败了新出现的怪人，这边迎接下一场挑战……",104,},
    [112] = {112,"深海之王下",111,1,30,4,4,4,10,20,30,23166,23167,23168,"打败了新出现的怪人，这边迎接下一场挑战……",105,},
    [113] = {113,"孤独的午餐",112,1,30,6,5,5,10,20,30,23169,23170,23171,"打败了新出现的怪人，这边迎接下一场挑战……",106,},
    [114] = {114,"奇袭梅怪人",113,1,30,6,6,6,10,20,30,23169,23170,23171,"打败了新出现的怪人，这边迎接下一场挑战……",107,},
    [115] = {115,"猫怪古力斯尼亚",114,1,30,6,7,7,10,20,30,23172,23173,23174,"打败了新出现的怪人，这边迎接下一场挑战……",108,},
    [116] = {116,"A级赏金犯牛牛",115,1,30,1,8,8,10,20,30,23172,23173,23174,"打败了新出现的怪人，这边迎接下一场挑战……",109,},
    [117] = {117,"地底之王",116,1,30,2,10,10,10,20,30,23175,23176,23177,"打败了新出现的怪人，这边迎接下一场挑战……",110,},
    [118] = {118,"天空之王",117,1,30,2,1,1,10,20,30,23175,23176,23177,"打败了新出现的怪人，这边迎接下一场挑战……",111,},
    [119] = {119,"吹雪组",118,1,30,8,3,3,10,20,30,23178,23179,23180,"打败了新出现的怪人，这边迎接下一场挑战……",112,},
    [120] = {120,"甜心假面",119,1,30,3,4,4,10,20,30,23178,23179,23180,"打败了新出现的怪人，这边迎接下一场挑战……",113,},
    [121] = {121,"性感囚犯",120,1,30,9,5,5,10,20,30,23181,23182,23183,"打败了新出现的怪人，这边迎接下一场挑战……",114,},
    [122] = {122,"敬请期待",121,1,0,0,0,0,10,20,30,0,0,0,"0",115,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [80] = 80,
    [81] = 81,
    [82] = 82,
    [83] = 83,
    [84] = 84,
    [85] = 85,
    [86] = 86,
    [87] = 87,
    [88] = 88,
    [89] = 89,
    [90] = 90,
    [91] = 91,
    [92] = 92,
    [93] = 93,
    [94] = 94,
    [95] = 95,
    [96] = 96,
    [97] = 97,
    [98] = 98,
    [99] = 99,
    [100] = 100,
    [101] = 101,
    [102] = 102,
    [103] = 103,
    [104] = 104,
    [105] = 105,
    [106] = 106,
    [107] = 107,
    [108] = 108,
    [109] = 109,
    [110] = 110,
    [111] = 111,
    [112] = 112,
    [113] = 113,
    [114] = 114,
    [115] = 115,
    [116] = 116,
    [117] = 117,
    [118] = 118,
    [119] = 119,
    [120] = 120,
    [121] = 121,
    [122] = 122,
}

local __key_map = {
    id = 1,
    name = 2,
    premise_id = 3,
    level = 4,
    star = 5,
    image = 6,
    map = 7,
    copy_pic = 8,
    copperbox_star = 9,
    silverbox_star = 10,
    goldbox_star = 11,
    copperbox_id = 12,
    silverbox_id = 13,
    goldbox_id = 14,
    direction = 15,
    story_id = 16,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_dungeon_chapter_info")
        return t._raw[__key_map[k]]
    end
}

function dungeon_chapter_info.getLength()
    return #dungeon_chapter_info._data
end

function dungeon_chapter_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function dungeon_chapter_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = dungeon_chapter_info._data[index]}, m)
end

function dungeon_chapter_info.get(id)
    local k = id
    return dungeon_chapter_info.indexOf(__index_id[k])
end

function dungeon_chapter_info.set(id, key, value)
    local record = dungeon_chapter_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function dungeon_chapter_info.get_index_data()
    return __index_id
end

