local record_story_talk_info = {}

record_story_talk_info.story_id = 0 --剧情ID
record_story_talk_info.step = 0 --剧情顺序
record_story_talk_info.monster_id = 0 --剧情：调用角色
record_story_talk_info.talk_position = 0 --位置朝向
record_story_talk_info.substance_boy = "" --对话内容（男）
record_story_talk_info.substance_girl = "" --对话内容（女）


story_talk_info = {
    _data = {
    [1] = {1,1,19003,1,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/44.png'/></root>","",},
    [2] = {1,2,0,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/8.png'/></root>","<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/8.png'/></root>",},
    [3] = {1,3,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [4] = {2,1,19003,1,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/14.png'/></root>","",},
    [5] = {2,2,0,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/33.png'/></root>","<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/33.png'/></root>",},
    [6] = {5,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [7] = {5,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [8] = {5,3,19005,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [9] = {1001,1,19006,1,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/33.png'/></root>","",},
    [10] = {1001,2,19007,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/37.png'/></root>","",},
    [11] = {1002,1,19006,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [12] = {1002,2,19007,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [13] = {1002,3,0,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/33.png'/></root>","<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/33.png'/></root>",},
    [14] = {1003,1,0,2,"<root><text value='战斗吧！英雄！' /> </root>","<root><text value='火战斗吧！英雄！' /> </root>",},
    [15] = {1003,2,19004,1,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/36.png'/></root>","",},
    [16] = {1003,3,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [17] = {1003,4,0,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/8.png'/></root>","<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/8.png'/></root>",},
    [18] = {1004,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [19] = {1005,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [20] = {1006,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [21] = {1007,1,0,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/53.png'/></root>","<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/53.png'/></root>",},
    [22] = {1007,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [23] = {1007,3,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [24] = {1007,4,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [25] = {1008,1,19005,1,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/44.png'/></root>","",},
    [26] = {1008,2,19003,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/36.png'/></root>","",},
    [27] = {1009,1,19003,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [28] = {1010,1,19005,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [29] = {1011,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [30] = {1011,2,19005,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [31] = {1012,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [32] = {1013,1,19003,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [33] = {1014,1,19003,2,"<root><text value='战斗吧！英雄！' /> <image path='ui/chat/face/36.png'/></root>","",},
    [34] = {1015,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [35] = {1016,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [36] = {1016,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [37] = {1017,1,0,2,"<root><text value='战斗吧！英雄！' /> </root>","<root><text value='战斗吧！英雄！' /> </root>",},
    [38] = {1017,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [39] = {1018,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [40] = {1018,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [41] = {1018,3,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [42] = {1019,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [43] = {1020,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [44] = {1020,2,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [45] = {1020,3,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [46] = {1021,1,19003,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [47] = {1022,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [48] = {1022,2,0,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [49] = {1023,1,19003,1,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [50] = {1023,2,0,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [51] = {1025,1,0,1,"<root><text value='战斗吧！英雄！' /> </root>","<root><text value='战斗吧！英雄！' /> </root>",},
    [52] = {1025,2,19003,2,"<root><text value='战斗吧！英雄！' /> </root>","",},
    [53] = {2011,1,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [54] = {2011,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [55] = {2011,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [56] = {2011,4,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [57] = {2012,1,10008,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [58] = {2012,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [59] = {2012,3,10008,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [60] = {2012,4,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [61] = {2013,1,10438,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [62] = {2013,2,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [63] = {2013,3,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [64] = {2013,4,10438,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [65] = {2014,1,10010,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [66] = {2014,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [67] = {2014,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [68] = {2014,4,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [69] = {2014,5,10010,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [70] = {2015,1,10012,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [71] = {2015,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [72] = {2015,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [73] = {2015,4,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [74] = {2015,5,10012,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [75] = {2015,6,10012,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [76] = {2021,1,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [77] = {2021,2,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [78] = {2021,3,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [79] = {2021,4,10014,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [80] = {2021,5,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [81] = {2022,1,10019,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [82] = {2022,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [83] = {2022,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [84] = {2022,4,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [85] = {2022,5,10019,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [86] = {2023,1,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [87] = {2023,2,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [88] = {2023,3,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [89] = {2024,1,10024,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [90] = {2024,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [91] = {2024,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [92] = {2024,4,10024,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [93] = {2025,1,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [94] = {2025,2,10027,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [95] = {2025,3,10027,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [96] = {2026,1,10027,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [97] = {2026,2,0,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [98] = {2031,1,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [99] = {2031,2,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [100] = {2031,3,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [101] = {2031,4,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [102] = {2032,1,10034,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [103] = {2032,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [104] = {2032,3,10034,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [105] = {2032,4,10034,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [106] = {2033,1,10037,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [107] = {2033,2,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [108] = {2033,3,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [109] = {2033,4,10037,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [110] = {2034,1,10037,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [111] = {2034,2,10037,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [112] = {2035,1,10044,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [113] = {2035,2,10044,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [114] = {2035,3,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [115] = {2036,1,10047,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [116] = {2036,2,19003,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [117] = {2036,3,10047,1,"战斗吧！英雄！","战斗吧！英雄！",},
    [118] = {2036,4,0,2,"战斗吧！英雄！","战斗吧！英雄！",},
    [119] = {2036,5,10047,1,"战斗吧！英雄！","战斗吧！英雄！",},
    }
}

local __index_story_id_step = {
    ["1_1"] = 1,
    ["1_2"] = 2,
    ["1_3"] = 3,
    ["2_1"] = 4,
    ["2_2"] = 5,
    ["5_1"] = 6,
    ["5_2"] = 7,
    ["5_3"] = 8,
    ["1001_1"] = 9,
    ["1001_2"] = 10,
    ["1002_1"] = 11,
    ["1002_2"] = 12,
    ["1002_3"] = 13,
    ["1003_1"] = 14,
    ["1003_2"] = 15,
    ["1003_3"] = 16,
    ["1003_4"] = 17,
    ["1004_1"] = 18,
    ["1005_1"] = 19,
    ["1006_1"] = 20,
    ["1007_1"] = 21,
    ["1007_2"] = 22,
    ["1007_3"] = 23,
    ["1007_4"] = 24,
    ["1008_1"] = 25,
    ["1008_2"] = 26,
    ["1009_1"] = 27,
    ["1010_1"] = 28,
    ["1011_1"] = 29,
    ["1011_2"] = 30,
    ["1012_1"] = 31,
    ["1013_1"] = 32,
    ["1014_1"] = 33,
    ["1015_1"] = 34,
    ["1016_1"] = 35,
    ["1016_2"] = 36,
    ["1017_1"] = 37,
    ["1017_2"] = 38,
    ["1018_1"] = 39,
    ["1018_2"] = 40,
    ["1018_3"] = 41,
    ["1019_1"] = 42,
    ["1020_1"] = 43,
    ["1020_2"] = 44,
    ["1020_3"] = 45,
    ["1021_1"] = 46,
    ["1022_1"] = 47,
    ["1022_2"] = 48,
    ["1023_1"] = 49,
    ["1023_2"] = 50,
    ["1025_1"] = 51,
    ["1025_2"] = 52,
    ["2011_1"] = 53,
    ["2011_2"] = 54,
    ["2011_3"] = 55,
    ["2011_4"] = 56,
    ["2012_1"] = 57,
    ["2012_2"] = 58,
    ["2012_3"] = 59,
    ["2012_4"] = 60,
    ["2013_1"] = 61,
    ["2013_2"] = 62,
    ["2013_3"] = 63,
    ["2013_4"] = 64,
    ["2014_1"] = 65,
    ["2014_2"] = 66,
    ["2014_3"] = 67,
    ["2014_4"] = 68,
    ["2014_5"] = 69,
    ["2015_1"] = 70,
    ["2015_2"] = 71,
    ["2015_3"] = 72,
    ["2015_4"] = 73,
    ["2015_5"] = 74,
    ["2015_6"] = 75,
    ["2021_1"] = 76,
    ["2021_2"] = 77,
    ["2021_3"] = 78,
    ["2021_4"] = 79,
    ["2021_5"] = 80,
    ["2022_1"] = 81,
    ["2022_2"] = 82,
    ["2022_3"] = 83,
    ["2022_4"] = 84,
    ["2022_5"] = 85,
    ["2023_1"] = 86,
    ["2023_2"] = 87,
    ["2023_3"] = 88,
    ["2024_1"] = 89,
    ["2024_2"] = 90,
    ["2024_3"] = 91,
    ["2024_4"] = 92,
    ["2025_1"] = 93,
    ["2025_2"] = 94,
    ["2025_3"] = 95,
    ["2026_1"] = 96,
    ["2026_2"] = 97,
    ["2031_1"] = 98,
    ["2031_2"] = 99,
    ["2031_3"] = 100,
    ["2031_4"] = 101,
    ["2032_1"] = 102,
    ["2032_2"] = 103,
    ["2032_3"] = 104,
    ["2032_4"] = 105,
    ["2033_1"] = 106,
    ["2033_2"] = 107,
    ["2033_3"] = 108,
    ["2033_4"] = 109,
    ["2034_1"] = 110,
    ["2034_2"] = 111,
    ["2035_1"] = 112,
    ["2035_2"] = 113,
    ["2035_3"] = 114,
    ["2036_1"] = 115,
    ["2036_2"] = 116,
    ["2036_3"] = 117,
    ["2036_4"] = 118,
    ["2036_5"] = 119,
}

local __key_map = {
    story_id = 1,
    step = 2,
    monster_id = 3,
    talk_position = 4,
    substance_boy = 5,
    substance_girl = 6,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_story_talk_info")
        return t._raw[__key_map[k]]
    end
}

function story_talk_info.getLength()
    return #story_talk_info._data
end

function story_talk_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function story_talk_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = story_talk_info._data[index]}, m)
end

function story_talk_info.get(story_id,step)
    local k = story_id .. '_'.. step
    return story_talk_info.indexOf(__index_story_id_step[k])
end

function story_talk_info.set(story_id,step, key, value)
    local record = story_talk_info.get(story_id,step)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function story_talk_info.get_index_data()
    return __index_story_id_step
end

