---@classdef record_vip_buy_info
local record_vip_buy_info = {}


record_vip_buy_info.id = 0--礼包id
record_vip_buy_info.vip_level = 0--vip等级
record_vip_buy_info.drop_id = 0--掉落表id
record_vip_buy_info.name =  ""--礼包名称
record_vip_buy_info.discount = 0--折扣
record_vip_buy_info.original_price = 0--原价
record_vip_buy_info.current_price = 0--现价
record_vip_buy_info.price_type = 0--货币类型
record_vip_buy_info.limit_buy = 0--购买次数

local vip_buy_info = {
   _data = {   
    [1] = {1001,0,8064,"活力礼包",300,1000,300,2,1,},  
    [2] = {1002,0,8065,"成长礼包",200,200,40,2,1,},  
    [3] = {2001,1,8064,"活力礼包",300,1000,300,2,2,},  
    [4] = {2002,1,8065,"成长礼包",200,200,40,2,2,},  
    [5] = {2004,1,8071,"资源礼包",250,740,185,2,3,},  
    [6] = {3001,2,8064,"活力礼包",300,1000,300,2,2,},  
    [7] = {3002,2,8065,"成长礼包",200,200,40,2,2,},  
    [8] = {3004,2,8071,"资源礼包",250,740,185,2,3,},  
    [9] = {4001,3,8064,"活力礼包",300,1000,300,2,2,},  
    [10] = {4002,3,8065,"成长礼包",200,200,40,2,2,},  
    [11] = {4004,3,8071,"资源礼包",250,740,185,2,3,},  
    [12] = {5001,4,8064,"活力礼包",300,1000,300,2,2,},  
    [13] = {5002,4,8065,"成长礼包",200,200,40,2,2,},  
    [14] = {5004,4,8071,"资源礼包",250,740,185,2,3,},  
    [15] = {6001,5,8064,"活力礼包",300,1000,300,2,3,},  
    [16] = {6002,5,8065,"成长礼包",200,200,40,2,3,},  
    [17] = {6004,5,8071,"资源礼包",250,740,185,2,6,},  
    [18] = {7001,6,8064,"活力礼包",300,1000,300,2,3,},  
    [19] = {7002,6,8065,"成长礼包",200,200,40,2,3,},  
    [20] = {7004,6,8071,"资源礼包",250,740,185,2,6,},  
    [21] = {8001,7,8064,"活力礼包",300,1000,300,2,3,},  
    [22] = {8002,7,8065,"成长礼包",200,200,40,2,3,},  
    [23] = {8004,7,8071,"资源礼包",250,740,185,2,6,},  
    [24] = {9001,8,8064,"活力礼包",300,1000,300,2,3,},  
    [25] = {9002,8,8065,"成长礼包",200,200,40,2,3,},  
    [26] = {9004,8,8071,"资源礼包",250,740,185,2,6,},  
    [27] = {1101,9,8064,"活力礼包",300,1000,300,2,3,},  
    [28] = {1102,9,8065,"成长礼包",200,200,40,2,3,},  
    [29] = {1104,9,8071,"资源礼包",250,740,185,2,6,},  
    [30] = {1201,10,8064,"活力礼包",300,1000,300,2,4,},  
    [31] = {1202,10,8065,"成长礼包",200,200,40,2,4,},  
    [32] = {1204,10,8071,"资源礼包",250,740,185,2,6,},  
    [33] = {1301,11,8064,"活力礼包",300,1000,300,2,4,},  
    [34] = {1302,11,8065,"成长礼包",200,200,40,2,4,},  
    [35] = {1304,11,8071,"资源礼包",250,740,185,2,6,},  
    [36] = {1401,12,8064,"活力礼包",300,1000,300,2,4,},  
    [37] = {1402,12,8065,"成长礼包",200,200,40,2,4,},  
    [38] = {1404,12,8071,"资源礼包",250,740,185,2,6,},  
    [39] = {1501,13,8064,"活力礼包",300,1000,300,2,5,},  
    [40] = {1502,13,8065,"成长礼包",200,200,40,2,5,},  
    [41] = {1504,13,8071,"资源礼包",250,740,185,2,6,},  
    [42] = {1601,14,8064,"活力礼包",300,1000,300,2,5,},  
    [43] = {1602,14,8065,"成长礼包",200,200,40,2,5,},  
    [44] = {1604,14,8071,"资源礼包",250,740,185,2,6,},  
    [45] = {1701,15,8064,"活力礼包",300,1000,300,2,5,},  
    [46] = {1702,15,8065,"成长礼包",200,200,40,2,5,},  
    [47] = {1703,15,8066,"宝物礼包",250,2500,625,2,5,},  
    [48] = {1704,15,8071,"资源礼包",250,740,185,2,6,},  
    [49] = {1801,16,8064,"活力礼包",300,1000,300,2,5,},  
    [50] = {1802,16,8065,"成长礼包",200,200,40,2,5,},  
    [51] = {1803,16,8066,"宝物礼包",250,2500,625,2,5,},  
    [52] = {1804,16,8071,"资源礼包",250,740,185,2,6,},
    }
}

local __index_id = {   
    [1001] = 1,  
    [1002] = 2,  
    [1101] = 27,  
    [1102] = 28,  
    [1104] = 29,  
    [1201] = 30,  
    [1202] = 31,  
    [1204] = 32,  
    [1301] = 33,  
    [1302] = 34,  
    [1304] = 35,  
    [1401] = 36,  
    [1402] = 37,  
    [1404] = 38,  
    [1501] = 39,  
    [1502] = 40,  
    [1504] = 41,  
    [1601] = 42,  
    [1602] = 43,  
    [1604] = 44,  
    [1701] = 45,  
    [1702] = 46,  
    [1703] = 47,  
    [1704] = 48,  
    [1801] = 49,  
    [1802] = 50,  
    [1803] = 51,  
    [1804] = 52,  
    [2001] = 3,  
    [2002] = 4,  
    [2004] = 5,  
    [3001] = 6,  
    [3002] = 7,  
    [3004] = 8,  
    [4001] = 9,  
    [4002] = 10,  
    [4004] = 11,  
    [5001] = 12,  
    [5002] = 13,  
    [5004] = 14,  
    [6001] = 15,  
    [6002] = 16,  
    [6004] = 17,  
    [7001] = 18,  
    [7002] = 19,  
    [7004] = 20,  
    [8001] = 21,  
    [8002] = 22,  
    [8004] = 23,  
    [9001] = 24,  
    [9002] = 25,  
    [9004] = 26,
}

local __key_map = { 
    id = 1,
    vip_level = 2,
    drop_id = 3,
    name = 4,
    discount = 5,
    original_price = 6,
    current_price = 7,
    price_type = 8,
    limit_buy = 9,
}

local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_vip_buy_info")

        return t._raw[__key_map[k]]
    end
}


function vip_buy_info.getLength()
    return #vip_buy_info._data
end



function vip_buy_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_vip_buy_info
function vip_buy_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = vip_buy_info._data[index]}, m)
end



---
--@return @class record_vip_buy_info
function vip_buy_info.get(id)
    
    return vip_buy_info.indexOf(__index_id[ id ])
     
end



function vip_buy_info.set(id, key, value)
    local record = vip_buy_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function vip_buy_info.get_index_data()
    return __index_id 
end

return  vip_buy_info 