local record_rebel_info = {}

record_rebel_info.id = 0 --叛军ID
record_rebel_info.name = "" --叛军名称
record_rebel_info.res_id = 0 --叛军形象
record_rebel_info.quality = 0 --叛军品质
record_rebel_info.prob = 0 --刷新概率
record_rebel_info.rebel_type = 0 --叛军类型
record_rebel_info.knight_id_1 = 0 --1号武将id
record_rebel_info.knight_id_2 = 0 --2号武将id
record_rebel_info.knight_id_3 = 0 --3号武将id
record_rebel_info.knight_id_4 = 0 --4号武将id
record_rebel_info.knight_id_5 = 0 --5号武将id
record_rebel_info.knight_id_6 = 0 --6号武将id
record_rebel_info.last_time = 0 --持续时间
record_rebel_info.appear_reward_type = 0 --发现奖励类型
record_rebel_info.appear_reward_value = 0 --发现奖励类型值
record_rebel_info.appear_reward_size = 0 --发现奖励数量
record_rebel_info.kill_reward_type = 0 --终结奖励类型
record_rebel_info.kill_reward_value = 0 --终结奖励类型值
record_rebel_info.kill_reward_size = 0 --终结奖励数量


rebel_info = {
    _data = {
    [1] = {1,"普通螃蟹怪",13018,2,60,1,0,0,0,0,3001,0,1800,2,0,5,2,0,5,},
    [2] = {2,"强壮螃蟹怪",13018,3,30,1,0,0,0,0,3002,0,3600,2,0,10,2,0,10,},
    [3] = {3,"凶残螃蟹怪",13018,4,10,1,0,0,0,0,3003,0,7200,2,0,15,2,0,15,},
    [4] = {4,"普通巨人",13006,2,60,2,3004,3005,3006,3007,3008,3009,1800,2,0,5,2,0,5,},
    [5] = {5,"强壮巨人",130062,3,30,2,3010,3011,3012,3013,3014,3015,3600,2,0,10,2,0,10,},
    [6] = {6,"凶残巨人",130063,4,10,2,3016,3017,3018,3019,3020,3021,7200,2,0,15,2,0,15,},
    [7] = {7,"普通蚊女王",14018,2,60,3,0,0,0,3022,3023,3024,1800,2,0,5,2,0,5,},
    [8] = {8,"强壮蚊女王",140182,3,30,3,0,0,0,3025,3026,3027,3600,2,0,10,2,0,10,},
    [9] = {9,"凶残蚊女王",140183,4,10,3,0,0,0,3028,3029,3030,7200,2,0,15,2,0,15,},
    [10] = {10,"普通万年蝉",13009,2,60,4,3031,3032,3033,3034,3035,3036,1800,2,0,5,2,0,5,},
    [11] = {11,"强壮万年蝉",130092,3,30,4,3037,3038,3039,3040,3041,3042,3600,2,0,10,2,0,10,},
    [12] = {12,"凶残万年蝉",130093,4,10,4,3043,3044,3045,3046,3047,3048,7200,2,0,15,2,0,15,},
    [13] = {13,"普通地底王",14006,2,60,5,3049,3050,3051,3052,3053,3054,1800,2,0,5,2,0,5,},
    [14] = {14,"强壮地底王",140062,3,30,5,3055,3056,3057,3058,3059,3060,3600,2,0,10,2,0,10,},
    [15] = {15,"凶残地底王",140063,4,10,5,3061,3062,3063,3064,3065,3066,7200,2,0,15,2,0,15,},
    [16] = {16,"普通天空王",12005,2,30,6,3067,3068,3069,3070,3071,3072,1800,2,0,5,2,0,5,},
    [17] = {17,"强壮天空王",120052,3,50,6,3073,3074,3075,3076,3077,3078,3600,2,0,10,2,0,10,},
    [18] = {18,"凶残天空王",120053,4,20,6,3079,3080,3081,3082,3083,3084,7200,2,0,15,2,0,15,},
    [19] = {19,"普通深海王",14005,2,40,7,3085,3085,3085,3085,3086,3085,1800,2,0,5,2,0,5,},
    [20] = {20,"强壮深海王",140052,3,30,7,3087,3087,3087,3087,3088,3087,3600,2,0,10,2,0,10,},
    [21] = {21,"凶残深海王",140053,4,20,7,3089,3089,3089,3089,3090,3089,7200,2,0,15,2,0,15,},
    [22] = {22,"疯狂深海王",140053,5,10,7,3091,3091,3091,3091,3092,3091,7200,2,0,20,2,0,20,},
    [23] = {23,"普通蜈蚣怪",13008,2,30,8,3093,3093,3093,3093,3094,3093,1800,2,0,5,2,0,5,},
    [24] = {24,"强壮蜈蚣怪",130082,3,25,8,3095,3095,3095,3095,3096,3095,3600,2,0,10,2,0,10,},
    [25] = {25,"凶残蜈蚣怪",130082,4,25,8,3097,3097,3097,3097,3098,3097,7200,2,0,15,2,0,15,},
    [26] = {26,"疯狂蜈蚣怪",130083,5,10,8,3099,3099,3099,3099,3100,3099,7200,2,0,20,2,0,20,},
    [27] = {27,"噩梦蜈蚣怪",130083,6,10,8,3101,3101,3101,3101,3102,3101,7200,2,0,25,2,0,25,},
    [28] = {28,"普通波罗斯",13007,2,30,9,3103,3103,3103,3103,3104,3103,1800,2,0,5,2,0,5,},
    [29] = {29,"强壮波罗斯",130072,3,25,9,3105,3105,3105,3105,3106,3105,3600,2,0,10,2,0,10,},
    [30] = {30,"凶残波罗斯",130072,4,25,9,3107,3107,3107,3107,3108,3107,7200,2,0,15,2,0,15,},
    [31] = {31,"疯狂波罗斯",130073,5,10,9,3109,3109,3109,3109,3110,3109,7200,2,0,20,2,0,20,},
    [32] = {32,"噩梦波罗斯",130073,6,10,9,3111,3111,3111,3111,3112,3111,7200,2,0,25,2,0,25,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
}

local __key_map = {
    id = 1,
    name = 2,
    res_id = 3,
    quality = 4,
    prob = 5,
    rebel_type = 6,
    knight_id_1 = 7,
    knight_id_2 = 8,
    knight_id_3 = 9,
    knight_id_4 = 10,
    knight_id_5 = 11,
    knight_id_6 = 12,
    last_time = 13,
    appear_reward_type = 14,
    appear_reward_value = 15,
    appear_reward_size = 16,
    kill_reward_type = 17,
    kill_reward_value = 18,
    kill_reward_size = 19,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_rebel_info")
        return t._raw[__key_map[k]]
    end
}

function rebel_info.getLength()
    return #rebel_info._data
end

function rebel_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function rebel_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = rebel_info._data[index]}, m)
end

function rebel_info.get(id)
    local k = id
    return rebel_info.indexOf(__index_id[k])
end

function rebel_info.set(id, key, value)
    local record = rebel_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function rebel_info.get_index_data()
    return __index_id
end

