local record_hard_dungeon_chapter_info = {}

record_hard_dungeon_chapter_info.id = 0 --章节ID
record_hard_dungeon_chapter_info.name = "" --章节名称
record_hard_dungeon_chapter_info.premise_id = 0 --前置章节
record_hard_dungeon_chapter_info.level = 0 --等级限制
record_hard_dungeon_chapter_info.star = 0 --章节总星数
record_hard_dungeon_chapter_info.image = 0 --城池icon
record_hard_dungeon_chapter_info.map = 0 --地图资源链接
record_hard_dungeon_chapter_info.copy_pic = 0 --章节入口图
record_hard_dungeon_chapter_info.copperbox_star = 0 --铜宝箱所需星数
record_hard_dungeon_chapter_info.silverbox_star = 0 --银宝箱所需星数
record_hard_dungeon_chapter_info.goldbox_star = 0 --金宝箱所需星数
record_hard_dungeon_chapter_info.copperbox_id = 0 --铜宝箱掉落库ID
record_hard_dungeon_chapter_info.silverbox_id = 0 --银宝箱掉落库ID
record_hard_dungeon_chapter_info.goldbox_id = 0 --金宝箱掉落库ID
record_hard_dungeon_chapter_info.text = "" --精英暴动怪物气泡文字
record_hard_dungeon_chapter_info.riot_map = 0 --精英暴动战斗地图


hard_dungeon_chapter_info = {
    _data = {
    [1] = {1,"精英第1章",0,1,12,9,8,8,4,8,12,52001,52002,52003,"这里可不是你这种人水平的人可以来的。",31013,},
    [2] = {2,"精英第2章",1,1,12,7,6,6,4,8,12,52001,52002,52003,"做我的信徒，得永生不挂科。",31007,},
    [3] = {3,"精英第3章",2,1,12,6,5,5,4,8,12,52004,52005,52006,"想偷袭我？作死啊",31002,},
    [4] = {4,"精英第4章",3,1,12,3,1,1,4,8,12,52004,52005,52006,"哼！每次都要我来救，真是没用！",31012,},
    [5] = {5,"精英第5章",4,1,12,5,7,7,4,8,12,52007,52008,52009,"不要慌，我马上就来就你。",31007,},
    [6] = {6,"精英第6章",5,1,12,8,10,10,4,8,12,52007,52008,52009,"美女是我的，钱是我的，你们也是我的。",31012,},
    [7] = {7,"精英第7章",6,1,12,5,3,3,4,8,12,52010,52011,52012,"想占我便宜？我一巴掌拍死你。",31003,},
    [8] = {8,"精英第8章",7,1,12,7,5,5,4,8,12,52010,52011,52012,"你那色眯眯的眼神看什么呢？信不信我一口盐汽水喷死你！",31007,},
    [9] = {9,"精英第9章",8,1,12,8,4,4,4,8,12,52013,52014,52015,"居然敢打我的主意，作死！",31002,},
    [10] = {10,"精英第10章",9,1,12,8,5,5,4,8,12,52013,52014,52015,"要想过此路，留下买路钱！",31002,},
    [11] = {11,"精英第11章",10,1,12,5,4,4,4,8,12,52016,52017,52018,"打劫！！！",31014,},
    [12] = {12,"精英第12章",11,1,12,5,8,8,4,8,12,52016,52017,52018,"你竟然敢叫我叔叔？小子作死！",31014,},
    [13] = {13,"精英第13章",12,1,12,5,7,7,4,8,12,52019,52020,52021,"敢来惹我？你想清楚后果了吗？",31014,},
    [14] = {14,"精英第14章",13,1,12,8,3,3,4,8,12,52019,52020,52021,"惹怒我的后果不是你可以想象的。",31002,},
    [15] = {15,"精英第15章",14,1,12,8,6,6,4,8,12,52022,52023,52024,"想动我朋友？先过我这关。",31002,},
    [16] = {16,"精英第16章",15,1,12,8,4,4,4,8,12,52022,52023,52024,"别嚣张！说的就是你。",31002,},
    [17] = {17,"精英第17章",16,1,12,3,10,10,4,8,12,52025,52026,52027,"你就想到你会来打我，还好我早有准备。",31000,},
    [18] = {18,"精英第18章",17,1,12,2,3,3,4,8,12,52025,52026,52027,"你想作死，我就成全你。",31012,},
    [19] = {19,"精英第19章",18,1,12,2,7,7,4,8,12,52028,52029,52030,"看什么看？没见过我这么有魅力的？",31012,},
    [20] = {20,"精英第20章",19,1,12,7,6,6,4,8,12,52028,52029,52030,"我从来就没输过。",31007,},
    [21] = {21,"精英第21章",20,1,12,5,5,5,4,8,12,52031,52032,52033,"一个小屁孩，胆敢来挑战史上最伟大我？",31003,},
    [22] = {22,"精英第22章",21,1,12,5,3,3,4,8,12,52031,52032,52033,"没有人是可以轻松战胜我的。",31003,},
    [23] = {23,"精英第23章",22,1,12,9,5,5,4,8,12,52034,52035,52036,"妈妈叫我来教训你！",31003,},
    [24] = {24,"精英第24章",23,1,12,2,4,4,4,8,12,52034,52035,52036,"快点，你妈喊你回家吃饭！",31014,},
    [25] = {25,"精英第25章",24,1,12,2,10,10,4,8,12,52037,52038,52039,"看到我出场，你还不跪下受死！",31014,},
    [26] = {26,"精英第26章",25,1,12,1,6,6,4,8,12,52037,52038,52039,"想我放过你吗？",31013,},
    [27] = {27,"精英第27章",26,1,12,2,3,3,4,8,12,52040,52041,52042,"小屁孩居然也敢嚣张，给我死吧。",31000,},
    [28] = {28,"精英第28章",27,1,12,2,5,5,4,8,12,52040,52041,52042,"有些东西你是无法逾越的。",31000,},
    [29] = {29,"精英第29章",28,1,12,3,6,6,4,8,12,52043,52044,52045,"你还想见到明天的太阳吗？",31014,},
    [30] = {30,"精英第30章",29,1,12,3,1,1,4,8,12,52043,52044,52045,"敢占我便宜？我会让你后悔的。",31014,},
    [31] = {31,"精英第31章",30,1,12,6,6,6,4,8,12,52046,52047,52048,"这里可不是你这种人水平的人可以来的。",31008,},
    [32] = {32,"精英第32章",31,1,12,9,1,1,4,8,12,52046,52047,52048,"做我的信徒，得永生不挂科。",31013,},
    [33] = {33,"精英第33章",32,1,12,2,8,8,4,8,12,52049,52050,52051,"想偷袭我？作死啊",31013,},
    [34] = {34,"精英第34章",33,1,12,2,10,10,4,8,12,52049,52050,52051,"哼！每次都要我来救，真是没用！",31013,},
    [35] = {35,"精英第35章",34,1,12,9,7,7,4,8,12,52052,52053,52054,"不要慌，我马上就来就你。",31000,},
    [36] = {36,"精英第36章",35,1,12,9,5,5,4,8,12,52052,52053,52054,"美女是我的，钱是我的，你们也是我的。",31000,},
    [37] = {37,"精英第37章",36,1,12,9,3,3,4,8,12,52055,52056,52057,"想占我便宜？我一巴掌拍死你。",31000,},
    [38] = {38,"精英第38章",37,1,12,2,4,4,4,8,12,52055,52056,52057,"你那色眯眯的眼神看什么呢？信不信我一口盐汽水喷死你！",31012,},
    [39] = {39,"精英第39章",38,1,12,2,5,5,4,8,12,52058,52059,52060,"居然敢打我的主意，作死！",31012,},
    [40] = {40,"精英第40章",39,1,12,2,3,3,4,8,12,52058,52059,52060,"要想过此路，留下买路钱！",31012,},
    [41] = {41,"精英第41章",40,1,12,9,4,4,4,8,12,52061,52062,52063,"打劫！！！",31011,},
    [42] = {42,"精英第42章",41,1,12,9,6,6,4,8,12,52061,52062,52063,"你竟然敢叫我叔叔？小子作死！",31011,},
    [43] = {43,"精英第43章",42,1,12,9,7,7,4,8,12,52064,52065,52066,"敢来惹我？你想清楚后果了吗？",31011,},
    [44] = {44,"精英第44章",43,1,12,4,10,10,4,8,12,52064,52065,52066,"惹怒我的后果不是你可以想象的。",31007,},
    [45] = {45,"精英第45章",44,1,12,5,5,5,4,8,12,52067,52068,52069,"想动我朋友？先过我这关。",31014,},
    [46] = {46,"精英第46章",45,1,12,4,8,8,4,8,12,52067,52068,52069,"别嚣张！说的就是你。",31007,},
    [47] = {47,"精英第47章",46,1,12,2,4,4,4,8,12,52070,52071,52072,"你就想到你会来打我，还好我早有准备。",31012,},
    [48] = {48,"精英第48章",47,1,12,2,10,10,4,8,12,52070,52071,52072,"你想作死，我就成全你。",31010,},
    [49] = {49,"精英第49章",48,1,12,1,6,6,4,8,12,52073,52074,52075,"看什么看？没见过我这么有魅力的？",31008,},
    [50] = {50,"精英第50章",49,1,12,6,1,1,4,8,12,52073,52074,52075,"我从来就没输过。",31014,},
    [51] = {51,"敬请期待",50,1,0,0,0,0,4,8,12,0,0,0,"0",0,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
}

local __key_map = {
    id = 1,
    name = 2,
    premise_id = 3,
    level = 4,
    star = 5,
    image = 6,
    map = 7,
    copy_pic = 8,
    copperbox_star = 9,
    silverbox_star = 10,
    goldbox_star = 11,
    copperbox_id = 12,
    silverbox_id = 13,
    goldbox_id = 14,
    text = 15,
    riot_map = 16,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_hard_dungeon_chapter_info")
        return t._raw[__key_map[k]]
    end
}

function hard_dungeon_chapter_info.getLength()
    return #hard_dungeon_chapter_info._data
end

function hard_dungeon_chapter_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function hard_dungeon_chapter_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = hard_dungeon_chapter_info._data[index]}, m)
end

function hard_dungeon_chapter_info.get(id)
    local k = id
    return hard_dungeon_chapter_info.indexOf(__index_id[k])
end

function hard_dungeon_chapter_info.set(id, key, value)
    local record = hard_dungeon_chapter_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function hard_dungeon_chapter_info.get_index_data()
    return __index_id
end

