local record_expansion_dungeon_stage_info = {}

record_expansion_dungeon_stage_info.id = 0 --编号
record_expansion_dungeon_stage_info.chapter_id = 0 --所属章节ID
record_expansion_dungeon_stage_info.name = "" --关卡名称
record_expansion_dungeon_stage_info.index = 0 --关卡编号
record_expansion_dungeon_stage_info.icon = 0 --怪物头像
record_expansion_dungeon_stage_info.image = 0 --怪物形象
record_expansion_dungeon_stage_info.quality = 0 --怪物品质
record_expansion_dungeon_stage_info.dungeonbattle_map = 0 --战斗背景图
record_expansion_dungeon_stage_info.monster_team_id = 0 --怪物组ID
record_expansion_dungeon_stage_info.pre_id = 0 --前置关卡ID
record_expansion_dungeon_stage_info.expend_type = 0 --挑战消耗类型
record_expansion_dungeon_stage_info.expend_value = 0 --挑战消耗类型值
record_expansion_dungeon_stage_info.expend_size = 0 --挑战消耗数量
record_expansion_dungeon_stage_info.target_type_1 = 0 --目标1类型
record_expansion_dungeon_stage_info.target_value_1 = 0 --目标1类型值
record_expansion_dungeon_stage_info.target_description_1 = "" --目标1描述
record_expansion_dungeon_stage_info.sucesss_talk_1 = "" --目标1达成描述
record_expansion_dungeon_stage_info.reward_type_1 = 0 --目标1奖励类型
record_expansion_dungeon_stage_info.reward_value_1 = 0 --目标1奖励类型值
record_expansion_dungeon_stage_info.reward_size_1 = 0 --目标1奖励数量
record_expansion_dungeon_stage_info.target_type_2 = 0 --目标2类型
record_expansion_dungeon_stage_info.target_value_2 = 0 --目标2类型值
record_expansion_dungeon_stage_info.target_description_2 = "" --目标2描述
record_expansion_dungeon_stage_info.sucesss_talk_2 = "" --目标2达成描述
record_expansion_dungeon_stage_info.reward_type_2 = 0 --目标2奖励类型
record_expansion_dungeon_stage_info.reward_value_2 = 0 --目标2奖励类型值
record_expansion_dungeon_stage_info.reward_size_2 = 0 --目标2奖励数量
record_expansion_dungeon_stage_info.target_type_3 = 0 --目标3类型
record_expansion_dungeon_stage_info.target_value_3 = 0 --目标3类型值
record_expansion_dungeon_stage_info.target_description_3 = "" --目标3描述
record_expansion_dungeon_stage_info.sucesss_talk_3 = "" --目标3达成描述
record_expansion_dungeon_stage_info.reward_type_3 = 0 --目标3奖励类型
record_expansion_dungeon_stage_info.reward_value_3 = 0 --目标3奖励类型值
record_expansion_dungeon_stage_info.reward_size_3 = 0 --目标3奖励数量


expansion_dungeon_stage_info = {
    _data = {
    [1] = {1,1,"鸟人",1,13032,13032,3,31007,80001,0,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [2] = {2,1,"大背头侠",2,14010,14010,3,31007,80002,1,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [3] = {3,1,"原始人",3,12041,12041,3,31007,80003,2,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [4] = {4,1,"地底王",4,140062,140062,3,31007,80004,3,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [5] = {5,1,"居合钢",5,140173,140173,4,31007,80005,4,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [6] = {6,1,"闪电侠",6,13019,13019,4,31007,80006,5,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [7] = {7,1,"深海之王",7,140052,140052,4,31007,80007,6,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [8] = {8,1,"梅而紫迦德",8,140232,140232,4,31007,80008,7,7,0,10,0,0,"全灭对方","消灭对方全体英雄",1,0,100000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,13,25,2,0,"我方全体存活","我方全体存活",3,6,100,},
    [9] = {9,2,"黑暗炎龙刀使",1,11015,11015,4,31014,80009,8,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [10] = {10,2,"狮子兽王",2,130103,130103,4,31014,80010,9,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [11] = {11,2,"地底王",3,140062,140062,4,31014,80011,10,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [12] = {12,2,"古力斯尼亚",4,120042,120042,5,31014,80012,11,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [13] = {13,2,"天空之王",5,120053,120053,5,31014,80013,12,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [14] = {14,2,"甜心假面",6,110013,110013,5,31014,80014,13,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [15] = {15,2,"童帝",7,110142,110142,5,31014,80015,14,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [16] = {16,2,"格洛里巴斯",8,120062,120062,5,31014,80016,15,7,0,15,0,0,"全灭对方","消灭对方全体英雄",1,0,150000,1,5,"5回合内全灭对方","在5回合内消灭对方全体英雄",3,18,100,2,0,"我方全体存活","我方全体存活",3,14,30,},
    [17] = {17,3,"奇袭梅",1,12039,12039,5,31007,80017,16,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [18] = {18,3,"机神G4",2,140023,140023,5,31007,80018,17,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [19] = {19,3,"海洋章鱼人",3,11034,11034,5,31007,80019,18,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [20] = {20,3,"银色獠牙",4,120033,120033,5,31007,80020,19,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [21] = {21,3,"小龙卷",5,120093,120093,5,31007,80021,20,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [22] = {22,3,"童帝",6,110142,110142,5,31007,80022,21,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [23] = {23,3,"吹雪",7,120083,120083,5,31007,80023,22,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [24] = {24,3,"格鲁甘修鲁",8,140192,140192,5,31007,80024,23,7,0,20,0,0,"全灭对方","消灭对方全体英雄",1,0,200000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,200,2,0,"我方全体存活","我方全体存活",23,0,300,},
    [25] = {25,4,"小美女",1,13025,13025,5,31014,80025,24,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [26] = {26,4,"红围巾斗士",2,13016,13016,5,31014,80026,25,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [27] = {27,4,"外星女王",3,130143,130143,5,31014,80027,26,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [28] = {28,4,"吹雪",4,120083,120083,5,31014,80028,27,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [29] = {29,4,"钻头武士",5,130043,130043,5,31014,80029,28,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [30] = {30,4,"饿狼",6,130033,130033,5,31014,80030,29,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [31] = {31,4,"驱动骑士",7,130053,130053,5,31014,80031,30,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [32] = {32,4,"波罗斯",8,130072,130072,5,31014,80032,31,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,250000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,1,2,0,"我方全体存活","我方全体存活",34,0,50,},
    [33] = {33,5,"海底人",1,11034,11034,5,31007,80033,32,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [34] = {34,5,"哈尔托里诺",2,14020,14020,5,31007,80034,33,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [35] = {35,5,"霸王花",3,13036,13036,5,31007,80035,34,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [36] = {36,5,"大背头侠",4,14010,14010,5,31007,80036,35,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [37] = {37,5,"赤鼻",5,14001,14001,5,31007,80037,36,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [38] = {38,5,"性感囚犯",6,140163,140163,5,31007,80038,37,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [39] = {39,5,"闪电侠",7,13019,13019,5,31007,80039,38,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [40] = {40,5,"梅而紫迦德",8,140233,140233,5,31007,80040,39,7,0,25,0,0,"全灭对方","消灭对方全体英雄",1,0,300000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,200,10,2,0,"我方全体存活","我方全体存活",29,0,300,},
    [41] = {41,6,"重战车兜裆布",1,11016,11016,5,31014,80041,40,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [42] = {42,6,"快拳黑人",2,14014,14014,5,31014,80042,41,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [43] = {43,6,"道馆弟子",3,11031,11031,5,31014,80043,42,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [44] = {44,6,"童帝",4,110142,110142,5,31014,80044,43,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [45] = {45,6,"小龙卷",5,120093,120093,5,31014,80045,44,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [46] = {46,6,"古力斯尼亚",6,120042,120042,5,31014,80046,45,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [47] = {47,6,"吹雪",7,120083,120083,5,31014,80047,46,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [48] = {48,6,"格洛里巴斯",8,120063,120063,5,31014,80048,47,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,500000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [49] = {49,7,"小女孩",1,13025,13025,5,31007,80049,48,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [50] = {50,7,"巴涅西凯",2,11017,11017,5,31007,80050,49,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [51] = {51,7,"外星女王",3,130143,130143,5,31007,80051,50,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [52] = {52,7,"变异巨人",4,130063,130063,5,31007,80052,51,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [53] = {53,7,"童帝",5,110142,110142,5,31007,80053,52,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [54] = {54,7,"饿狼",6,130033,130033,6,31007,80054,53,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [55] = {55,7,"驱动骑士",7,130053,130053,6,31007,80055,54,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [56] = {56,7,"格鲁甘修鲁",8,140193,140193,6,31007,80056,55,7,0,30,0,0,"全灭对方","消灭对方全体英雄",1,0,600000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,2,2,0,"我方全体存活","我方全体存活",13,0,400,},
    [57] = {57,8,"原始人王八",1,12041,12041,5,31014,80057,56,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [58] = {58,8,"百年蝉幼虫",2,11026,11026,5,31014,80058,57,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [59] = {59,8,"大力怪",3,12039,12039,5,31014,80059,58,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [60] = {60,8,"武装大猩猩",4,130023,130023,5,31014,80060,59,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [61] = {61,8,"小龙卷",5,120093,120093,6,31014,80061,60,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [62] = {62,8,"古力斯尼亚",6,120042,120042,6,31014,80062,61,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [63] = {63,8,"吹雪",7,120083,120083,6,31014,80063,62,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    [64] = {64,8,"变身波罗斯",8,130073,130073,6,31014,80064,63,7,0,35,0,0,"全灭对方","消灭对方全体英雄",1,0,800000,1,4,"4回合内全灭对方","在4回合内消灭对方全体英雄",3,295,1,2,0,"我方全体存活","我方全体存活",34,0,150,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
}

local __key_map = {
    id = 1,
    chapter_id = 2,
    name = 3,
    index = 4,
    icon = 5,
    image = 6,
    quality = 7,
    dungeonbattle_map = 8,
    monster_team_id = 9,
    pre_id = 10,
    expend_type = 11,
    expend_value = 12,
    expend_size = 13,
    target_type_1 = 14,
    target_value_1 = 15,
    target_description_1 = 16,
    sucesss_talk_1 = 17,
    reward_type_1 = 18,
    reward_value_1 = 19,
    reward_size_1 = 20,
    target_type_2 = 21,
    target_value_2 = 22,
    target_description_2 = 23,
    sucesss_talk_2 = 24,
    reward_type_2 = 25,
    reward_value_2 = 26,
    reward_size_2 = 27,
    target_type_3 = 28,
    target_value_3 = 29,
    target_description_3 = 30,
    sucesss_talk_3 = 31,
    reward_type_3 = 32,
    reward_value_3 = 33,
    reward_size_3 = 34,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_expansion_dungeon_stage_info")
        return t._raw[__key_map[k]]
    end
}

function expansion_dungeon_stage_info.getLength()
    return #expansion_dungeon_stage_info._data
end

function expansion_dungeon_stage_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function expansion_dungeon_stage_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = expansion_dungeon_stage_info._data[index]}, m)
end

function expansion_dungeon_stage_info.get(id)
    local k = id
    return expansion_dungeon_stage_info.indexOf(__index_id[k])
end

function expansion_dungeon_stage_info.set(id, key, value)
    local record = expansion_dungeon_stage_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function expansion_dungeon_stage_info.get_index_data()
    return __index_id
end

