local record_ksoul_info = {}

record_ksoul_info.id = 0 --将灵id
record_ksoul_info.name = "" --将灵名称
record_ksoul_info.name2 = "" --灵阵图中名称
record_ksoul_info.quality = 0 --将灵品质
record_ksoul_info.ksoul_camp = 0 --将灵阵营
record_ksoul_info.res_id = 0 --将灵图标id
record_ksoul_info.directions = "" --将灵描述
record_ksoul_info.ksoul_point = 0 --分解可得灵玉
record_ksoul_info.gm = 0 --GM后台是否可发


ksoul_info = {
    _data = {
    [1] = {1,"精魂·琦玉","琦玉",6,1,11002,"又是一拳解决战斗，真无聊……",2000,1,},
    [2] = {2,"精魂·音速索尼克","音速索尼克",6,1,11007,"我是忍者村长大的忍者……",2000,1,},
    [3] = {3,"精魂·银色獠牙","银色獠牙",6,2,12003,"好久没好好活动一下了。",2000,1,},
    [4] = {4,"精魂·小龙卷","小龙卷",6,2,12009,"真碍眼，消失吧！",2000,1,},
    [5] = {5,"精魂·饿狼","饿狼",6,3,13003,"狩猎英雄开始了……",2000,1,},
    [6] = {6,"精魂·波罗斯","波罗斯",6,3,13007,"你还没有让我发挥实力的资格！",2000,1,},
    [7] = {7,"精魂·深海之王","深海之王",6,4,14005,"真无趣，一个都别想逃！",2000,1,},
    [8] = {8,"精魂·金属骑士","金属骑士",6,4,14003,"火力全开，发射！",2000,1,},
    [9] = {9,"精魂·超合金黑光","超合金黑光",5,1,11003,"大家都在看我的肉体……",300,1,},
    [10] = {10,"精魂·原子武士","原子武士",5,1,11004,"看招，原子斩！",300,1,},
    [11] = {11,"精魂·背心尊者","背心尊者",5,1,11005,"有一身肌肉的才叫男人！",300,1,},
    [12] = {12,"精魂·僵尸男","僵尸男",5,1,11006,"哼哼，我是不死之身……",300,1,},
    [13] = {13,"精魂·甜心假面","甜心假面",5,1,11001,"不想让垃圾升到S级……",300,1,},
    [14] = {14,"精魂·闪光佛莱士","闪光佛莱士",5,1,11009,"给你点教训！",300,1,},
    [15] = {15,"精魂·KING","KING",5,1,11011,"好可怕，好可怕……",300,1,},
    [16] = {16,"精魂·金属球棒","金属球棒",5,1,11012,"哼，打得你不能自理！",300,1,},
    [17] = {17,"精魂·童帝","童帝",5,1,11014,"你们真笨……",300,1,},
    [18] = {18,"精魂·古力斯尼亚","古力斯尼亚",5,2,12004,"喵喵喵……",300,1,},
    [19] = {19,"精魂·杰诺斯","杰诺斯",5,2,12001,"只要不大意，我就不会输……",300,1,},
    [20] = {20,"精魂·天空之王","天空之王",5,2,12005,"我是天空之王！",300,1,},
    [21] = {21,"精魂·格洛里巴斯","格洛里巴斯",5,2,12006,"你也到此为止了！",300,1,},
    [22] = {22,"精魂·钉锤头","钉锤头",5,2,12007,"头骨硬真是太好了……",300,1,},
    [23] = {23,"精魂·吹雪","吹雪",5,2,12008,"加入我的吹雪组吧！",300,1,},
    [24] = {24,"精魂·警犬侠","警犬侠",5,2,12010,"我不是单身，汪汪！",300,1,},
    [25] = {25,"精魂·猪神","猪神",5,2,12012,"还有什么好吃的吗？",300,1,},
    [26] = {26,"精魂·海带人","海带人",5,2,12016,"鬼城怪物传说……",300,1,},
    [27] = {27,"精魂·钻头武士","钻头武士",5,3,13004,"男人就该用刀说话！",300,1,},
    [28] = {28,"精魂·驱动骑士","驱动骑士",5,3,13005,"要小心金属骑士……",300,1,},
    [29] = {29,"精魂·变异巨人","变异巨人",5,3,13006,"空虚寂寞冷……",300,1,},
    [30] = {30,"精魂·武装大猩猩","武装大猩猩",5,3,13002,"对不起，我说实话……",300,1,},
    [31] = {31,"精魂·蜈蚣长老","蜈蚣长老",5,3,13008,"我讨厌人类，消灭你们！",300,1,},
    [32] = {32,"精魂·十七万年蝉成虫","万年蝉成虫",5,3,13009,"地底好暗啊……",300,1,},
    [33] = {33,"精魂·狮子兽王","狮子兽王",5,3,13010,"让你无法抵抗！",300,1,},
    [34] = {34,"精魂·梅而紫迦德","梅而紫迦德",5,3,14023,"真是弱小的种族！",300,1,},
    [35] = {35,"精魂·外星女王","外星女王",5,3,13014,"噢呵呵呵呵……",300,1,},
    [36] = {36,"精魂·地底王","地底王",5,4,14006,"地上人都去死吧！",300,1,},
    [37] = {37,"精魂·变异疫苗人","变异疫苗人",5,4,14007,"消灭人类！",300,1,},
    [38] = {38,"精魂·丘舞太刀","丘舞太刀",5,4,14009,"飞舞吧，太刀！",300,1,},
    [39] = {39,"精魂·阿修罗盔甲","阿修罗盔甲",5,4,14015,"阿修罗模式发动！",300,1,},
    [40] = {40,"精魂·性感囚犯","性感囚犯",5,4,14016,"为了男孩子们，我不能输……",300,1,},
    [41] = {41,"精魂·居合钢","居合钢",5,4,14017,"你以为我感觉不到你的杀气吗？",300,1,},
    [42] = {42,"精魂·机神G4","机神G4",5,4,14002,"KING在哪里？",300,1,},
    [43] = {43,"精魂·蚊女王","蚊女王",5,4,14018,"来吧，孩子们，给我果汁……",300,1,},
    [44] = {44,"精魂·格鲁甘修鲁","格鲁甘修鲁",5,4,14019,"我是宇宙第一的念动力大师！",300,1,},
    [45] = {45,"精魂·毒刺","毒刺",4,1,11008,"我是毒刺，各位请多关照！",50,1,},
    [46] = {46,"精魂·山猿","山猿",4,1,11010,"大姐头让我教训你！",50,1,},
    [47] = {47,"精魂·蛇咬拳斯内克","蛇咬拳斯内克",4,1,11013,"努力成为像我这样了不起的英雄吧！",50,1,},
    [48] = {48,"精魂·黑暗炎龙刀使","黑暗炎龙刀使",4,1,11015,"让开，由我来！",50,1,},
    [49] = {49,"精魂·重战车兜裆布","重战车兜裆布",4,1,11016,"我虽然穿的少，但是我很强！",50,1,},
    [50] = {50,"精魂·巴涅西凯","巴涅西凯",4,1,11017,"尝尝我的剑法吧！",50,1,},
    [51] = {51,"精魂·协会管理员","协会管理员",4,1,11018,"大家往这边站一点，不要拥挤。",50,1,},
    [52] = {52,"精魂·雷光贤治","雷光贤治",4,1,11019,"看我的电击棒！",50,1,},
    [53] = {53,"精魂·青焰","青焰",4,1,11020,"尝尝我的火焰吧！",50,1,},
    [54] = {54,"精魂·学生","学生",4,2,12011,"大家一起上啊！",50,1,},
    [55] = {55,"精魂·睫毛","睫毛",4,2,12013,"看什么看，夹你啊！",50,1,},
    [56] = {56,"精魂·老虎背心","老虎背心",4,2,12014,"你这可疑人物！",50,1,},
    [57] = {57,"精魂·匹克","匹克",4,2,12015,"我玩游戏可是高手。",50,1,},
    [58] = {58,"精魂·黄金球","黄金球",4,2,12017,"先下手为强！",50,1,},
    [59] = {59,"精魂·魔术妙手","魔术妙手",4,2,12018,"看我的魔术！",50,1,},
    [60] = {60,"精魂·无证骑士","无证骑士",4,2,12019,"无证骑士驾到！",50,1,},
    [61] = {61,"精魂·牛牛","牛牛",4,2,12002,"把钱都装进这个袋子里面！",50,1,},
    [62] = {62,"精魂·莫西干头","莫西干头",4,3,13011,"样子像流氓，但其实我是个英雄……",50,1,},
    [63] = {63,"精魂·丧服吊带","丧服吊带",4,3,13012,"我们可是经过专门配合训练的！",50,1,},
    [64] = {64,"精魂·大哲人","大哲人",4,3,13013,"少年，这是哲学……",50,1,},
    [65] = {65,"精魂·背心黑洞","背心黑洞",4,3,13015,"背心黑洞来也……",50,1,},
    [66] = {66,"精魂·红围巾斗士","红围巾斗士",4,3,13016,"得叫支援了吗？",50,1,},
    [67] = {67,"精魂·冲天好小子","冲天好小子",4,3,13017,"大家一起上啊！",50,1,},
    [68] = {68,"精魂·螃蟹怪人","螃蟹怪人",4,3,13018,"我在找下巴开裂的小孩！",50,1,},
    [69] = {69,"精魂·闪电侠","闪电侠",4,3,13019,"还是找个机会开溜吧……",50,1,},
    [70] = {70,"精魂·十字键","十字键",4,4,14008,"我们可是经过专门配合训练的！",50,1,},
    [71] = {71,"精魂·大背头侠","大背头侠",4,4,14010,"吓尿了……",50,1,},
    [72] = {72,"精魂·赤鼻","赤鼻",4,4,14001,"我也有些许习武心得啊……",50,1,},
    [73] = {73,"精魂·菠萝人","菠萝人",4,4,14011,"其实我是一直菠萝……",50,1,},
    [74] = {74,"精魂·乌马洪","乌马洪",4,4,14012,"马是不会说话的……",50,1,},
    [75] = {75,"精魂·海比空格","海比空格",4,4,14013,"这里没有异状！",50,1,},
    [76] = {76,"精魂·快拳侠","快拳侠",4,4,14014,"你看的清我的拳吗？",50,1,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
}

local __key_map = {
    id = 1,
    name = 2,
    name2 = 3,
    quality = 4,
    ksoul_camp = 5,
    res_id = 6,
    directions = 7,
    ksoul_point = 8,
    gm = 9,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_ksoul_info")
        return t._raw[__key_map[k]]
    end
}

function ksoul_info.getLength()
    return #ksoul_info._data
end

function ksoul_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function ksoul_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = ksoul_info._data[index]}, m)
end

function ksoul_info.get(id)
    local k = id
    return ksoul_info.indexOf(__index_id[k])
end

function ksoul_info.set(id, key, value)
    local record = ksoul_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function ksoul_info.get_index_data()
    return __index_id
end

