local record_ksoul_dungeon_info = {}

record_ksoul_dungeon_info.id = 0 --副本id
record_ksoul_dungeon_info.name = "" --关卡名称
record_ksoul_dungeon_info.quality = 0 --关卡品质
record_ksoul_dungeon_info.res_id = 0 --关卡形象
record_ksoul_dungeon_info.talk = "" --气泡内容
record_ksoul_dungeon_info.dungeon_pro = 0 --刷新权值
record_ksoul_dungeon_info.monster_team = 0 --怪物组ID
record_ksoul_dungeon_info.ksoul_point = 0 --奖励灵玉（必掉）
record_ksoul_dungeon_info.ksoul_id1 = 0 --奖励将灵1
record_ksoul_dungeon_info.ksoul_size1 = 0 --奖励数量1
record_ksoul_dungeon_info.ksoul_pro1 = 0 --奖励1概率


ksoul_dungeon_info = {
    _data = {
    [1] = {1,"琦玉",6,11002,"又是一拳解决战斗，真无聊……",37,45001,400,1,1,10000,},
    [2] = {2,"音速索尼克",6,11007,"我是忍者村长大的忍者……",37,45002,400,2,1,10000,},
    [3] = {3,"银色獠牙",6,12003,"好久没好好活动一下了。",37,45003,400,3,1,10000,},
    [4] = {4,"小龙卷",6,12009,"真碍眼，消失吧！",37,45004,400,4,1,10000,},
    [5] = {5,"饿狼",6,13003,"狩猎英雄开始了……",37,45005,400,5,1,10000,},
    [6] = {6,"波罗斯",6,13007,"你还没有让我发挥实力的资格！",37,45006,400,6,1,10000,},
    [7] = {7,"深海之王",6,14005,"真无趣，一个都别想逃！",37,45007,400,7,1,10000,},
    [8] = {8,"金属骑士",6,14003,"火力全开，发射！",37,45008,400,8,1,10000,},
    [9] = {9,"超合金黑光",5,11003,"大家都在看我的肉体……",89,45009,60,9,1,10000,},
    [10] = {10,"原子武士",5,11004,"看招，原子斩！",89,45010,60,10,1,10000,},
    [11] = {11,"背心尊者",5,11005,"有一身肌肉的才叫男人！",89,45011,60,11,1,10000,},
    [12] = {12,"僵尸男",5,11006,"哼哼，我是不死之身……",89,45012,60,12,1,10000,},
    [13] = {13,"甜心假面",5,11001,"不想让垃圾升到S级……",89,45013,60,13,1,10000,},
    [14] = {14,"闪光佛莱士",5,11009,"给你点教训！",89,45014,60,14,1,10000,},
    [15] = {15,"KING",5,11011,"好可怕，好可怕……",89,45015,60,15,1,10000,},
    [16] = {16,"金属球棒",5,11012,"哼，打得你不能自理！",89,45016,60,16,1,10000,},
    [17] = {17,"童帝",5,11014,"你们真笨……",89,45017,60,17,1,10000,},
    [18] = {18,"古力斯尼亚",5,12004,"喵喵喵……",89,45018,60,18,1,10000,},
    [19] = {19,"杰诺斯",5,12001,"只要不大意，我就不会输……",89,45019,60,19,1,10000,},
    [20] = {20,"天空之王",5,12005,"我是天空之王！",89,45020,60,20,1,10000,},
    [21] = {21,"格洛里巴斯",5,12006,"你也到此为止了！",89,45021,60,21,1,10000,},
    [22] = {22,"钉锤头",5,12007,"头骨硬真是太好了……",89,45022,60,22,1,10000,},
    [23] = {23,"吹雪",5,12008,"加入我的吹雪组吧！",89,45023,60,23,1,10000,},
    [24] = {24,"警犬侠",5,12010,"我不是单身，汪汪！",89,45024,60,24,1,10000,},
    [25] = {25,"猪神",5,12012,"还有什么好吃的吗？",89,45025,60,25,1,10000,},
    [26] = {26,"海带人",5,12016,"鬼城怪物传说……",89,45026,60,26,1,10000,},
    [27] = {27,"钻头武士",5,13004,"男人就该用刀说话！",89,45027,60,27,1,10000,},
    [28] = {28,"驱动骑士",5,13005,"要小心金属骑士……",89,45028,60,28,1,10000,},
    [29] = {29,"变异巨人",5,13006,"空虚寂寞冷……",89,45029,60,29,1,10000,},
    [30] = {30,"武装大猩猩",5,13002,"对不起，我说实话……",89,45030,60,30,1,10000,},
    [31] = {31,"蜈蚣长老",5,13008,"我讨厌人类，消灭你们！",89,45031,60,31,1,10000,},
    [32] = {32,"万年蝉成虫",5,13009,"地底好暗啊……",89,45032,60,32,1,10000,},
    [33] = {33,"狮子兽王",5,13010,"让你无法抵抗！",89,45033,60,33,1,10000,},
    [34] = {34,"梅而紫迦德",5,14023,"真是弱小的种族！",89,45034,60,34,1,10000,},
    [35] = {35,"外星女王",5,13014,"噢呵呵呵呵……",89,45035,60,35,1,10000,},
    [36] = {36,"地底王",5,14006,"地上人都去死吧！",89,45036,60,36,1,10000,},
    [37] = {37,"变异疫苗人",5,14007,"消灭人类！",89,45037,60,37,1,10000,},
    [38] = {38,"丘舞太刀",5,14009,"飞舞吧，太刀！",89,45038,60,38,1,10000,},
    [39] = {39,"阿修罗盔甲",5,14015,"阿修罗模式发动！",89,45039,60,39,1,10000,},
    [40] = {40,"性感囚犯",5,14016,"为了男孩子们，我不能输……",89,45040,60,40,1,10000,},
    [41] = {41,"居合钢",5,14017,"你以为我感觉不到你的杀气吗？",89,45041,60,41,1,10000,},
    [42] = {42,"机神G4",5,14002,"KING在哪里？",89,45042,60,42,1,10000,},
    [43] = {43,"蚊女王",5,14018,"来吧，孩子们，给我果汁……",89,45043,60,43,1,10000,},
    [44] = {44,"格鲁甘修鲁",5,14019,"我是宇宙第一的念动力大师！",89,45044,60,44,1,10000,},
    [45] = {45,"毒刺",4,11008,"我是毒刺，各位请多关照！",204,45045,10,45,1,10000,},
    [46] = {46,"山猿",4,11010,"大姐头让我教训你！",204,45046,10,46,1,10000,},
    [47] = {47,"蛇咬拳斯内克",4,11013,"努力成为像我这样了不起的英雄吧！",204,45047,10,47,1,10000,},
    [48] = {48,"黑暗炎龙刀使",4,11015,"让开，由我来！",204,45048,10,48,1,10000,},
    [49] = {49,"重战车兜裆布",4,11016,"我虽然穿的少，但是我很强！",203,45049,10,49,1,10000,},
    [50] = {50,"巴涅西凯",4,11017,"尝尝我的剑法吧！",203,45050,10,50,1,10000,},
    [51] = {51,"协会管理员",4,11018,"大家往这边站一点，不要拥挤。",203,45051,10,51,1,10000,},
    [52] = {52,"雷光贤治",4,11019,"看我的电击棒！",203,45052,10,52,1,10000,},
    [53] = {53,"青焰",4,11020,"尝尝我的火焰吧！",203,45053,10,53,1,10000,},
    [54] = {54,"学生",4,12011,"大家一起上啊！",203,45054,10,54,1,10000,},
    [55] = {55,"睫毛",4,12013,"看什么看，夹你啊！",203,45055,10,55,1,10000,},
    [56] = {56,"老虎背心",4,12014,"你这可疑人物！",203,45056,10,56,1,10000,},
    [57] = {57,"匹克",4,12015,"我玩游戏可是高手。",203,45057,10,57,1,10000,},
    [58] = {58,"黄金球",4,12017,"先下手为强！",203,45058,10,58,1,10000,},
    [59] = {59,"魔术妙手",4,12018,"看我的魔术！",203,45059,10,59,1,10000,},
    [60] = {60,"无证骑士",4,12019,"无证骑士驾到！",203,45060,10,60,1,10000,},
    [61] = {61,"牛牛",4,12002,"把钱都装进这个袋子里面！",203,45061,10,61,1,10000,},
    [62] = {62,"莫西干头",4,13011,"样子像流氓，但其实我是个英雄……",203,45062,10,62,1,10000,},
    [63] = {63,"丧服吊带",4,13012,"我们可是经过专门配合训练的！",203,45063,10,63,1,10000,},
    [64] = {64,"大哲人",4,13013,"少年，这是哲学……",203,45064,10,64,1,10000,},
    [65] = {65,"背心黑洞",4,13015,"背心黑洞来也……",203,45065,10,65,1,10000,},
    [66] = {66,"红围巾斗士",4,13016,"得叫支援了吗？",203,45066,10,66,1,10000,},
    [67] = {67,"冲天好小子",4,13017,"大家一起上啊！",203,45067,10,67,1,10000,},
    [68] = {68,"螃蟹怪人",4,13018,"我在找下巴开裂的小孩！",203,45068,10,68,1,10000,},
    [69] = {69,"闪电侠",4,13019,"还是找个机会开溜吧……",203,45069,10,69,1,10000,},
    [70] = {70,"十字键",4,14008,"我们可是经过专门配合训练的！",203,45070,10,70,1,10000,},
    [71] = {71,"大背头侠",4,14010,"吓尿了……",203,45071,10,71,1,10000,},
    [72] = {72,"赤鼻",4,14001,"我也有些许习武心得啊……",203,45072,10,72,1,10000,},
    [73] = {73,"菠萝人",4,14011,"其实我是一直菠萝……",203,45073,10,73,1,10000,},
    [74] = {74,"乌马洪",4,14012,"马是不会说话的……",203,45074,10,74,1,10000,},
    [75] = {75,"海比空格",4,14013,"这里没有异状！",203,45075,10,75,1,10000,},
    [76] = {76,"快拳侠",4,14014,"你看的清我的拳吗？",203,45076,10,76,1,10000,},
    }
}

local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
}

local __key_map = {
    id = 1,
    name = 2,
    quality = 3,
    res_id = 4,
    talk = 5,
    dungeon_pro = 6,
    monster_team = 7,
    ksoul_point = 8,
    ksoul_id1 = 9,
    ksoul_size1 = 10,
    ksoul_pro1 = 11,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_ksoul_dungeon_info")
        return t._raw[__key_map[k]]
    end
}

function ksoul_dungeon_info.getLength()
    return #ksoul_dungeon_info._data
end

function ksoul_dungeon_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function ksoul_dungeon_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = ksoul_dungeon_info._data[index]}, m)
end

function ksoul_dungeon_info.get(id)
    local k = id
    return ksoul_dungeon_info.indexOf(__index_id[k])
end

function ksoul_dungeon_info.set(id, key, value)
    local record = ksoul_dungeon_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function ksoul_dungeon_info.get_index_data()
    return __index_id
end

