local record_item_awaken_info = {}

record_item_awaken_info.id = 0 --道具编号
record_item_awaken_info.name = "" --道具名
record_item_awaken_info.icon = "" --道具icon
record_item_awaken_info.comment = "" --道具描述
record_item_awaken_info.quality = 0 --道具品质
record_item_awaken_info.str_type_1 = 0 --加成属性类型1
record_item_awaken_info.str_value_1 = 0 --加成属性类型值1
record_item_awaken_info.str_type_2 = 0 --加成属性类型2
record_item_awaken_info.str_value_2 = 0 --加成属性类型值2
record_item_awaken_info.str_type_3 = 0 --加成属性类型3
record_item_awaken_info.str_value_3 = 0 --加成属性类型值3
record_item_awaken_info.compose_id = 0 --合成表id
record_item_awaken_info.price_type = 0 --出售价格类型
record_item_awaken_info.price = 0 --出售价格类型值
record_item_awaken_info.is_drop = 0 --是否可模糊掉落
record_item_awaken_info.gm = 0 --gm后台是否可发放
record_item_awaken_info.relife_value = 0 --回收返还


item_awaken_info = {
    _data = {
    [1] = {111,"大象花洒","icon/awaken/111.png","琦玉用来浇花的花洒……",1,5,215,6,36,21,10,0,11,4,1,1,4,},
    [2] = {112,"小孩的足球","icon/awaken/112.png","双下巴小孩的玩具",1,5,215,6,36,21,10,0,11,4,1,1,4,},
    [3] = {113,"电视机","icon/awaken/113.png","灾害信息都从电视节目中获得。",1,5,215,6,36,21,10,0,11,4,1,1,4,},
    [4] = {114,"药剂","icon/awaken/114.png","吃了好像会变巨人。",1,5,215,6,36,21,10,0,11,4,1,1,4,},
    [5] = {121,"上班族公文包","icon/awaken/121.png","琦玉找工作的时候用的……",1,5,270,6,22,21,13,0,11,4,1,1,4,},
    [6] = {122,"秋千","icon/awaken/122.png","公园里的秋千。",1,5,270,6,22,21,13,0,11,4,1,1,4,},
    [7] = {123,"闹钟","icon/awaken/123.png","之前那个被琦玉一拳打爆了，这是新买的……",1,5,270,6,22,21,13,0,11,4,1,1,4,},
    [8] = {124,"上班族眼镜","icon/awaken/124.png","天天加班，高度近视了。",1,5,270,6,22,21,13,0,11,4,1,1,4,},
    [9] = {131,"仙人掌","icon/awaken/131.png","琦玉养的仙人掌。",1,5,240,6,30,21,12,0,11,4,1,1,4,},
    [10] = {132,"龙虾火锅","icon/awaken/132.png","邦古老师在道场里准备请客的火锅。",1,5,240,6,30,21,12,0,11,4,1,1,4,},
    [11] = {133,"茶杯","icon/awaken/133.png","琦玉经常用的杯子。",1,5,240,6,30,21,12,0,11,4,1,1,4,},
    [12] = {134,"寿司","icon/awaken/134.png","旋转寿司店里的精致寿司。",1,5,240,6,30,21,12,0,11,4,1,1,4,},
    [13] = {211,"500元硬币","icon/awaken/211.png","可以在自动贩卖机使用。",2,5,382,6,64,21,19,2111,11,14,1,1,14,},
    [14] = {212,"博士的相框","icon/awaken/212.png","博士年轻时的照片。",2,5,382,6,64,21,19,2121,11,14,1,1,14,},
    [15] = {213,"冲锋枪","icon/awaken/213.png","对付怪人似乎没什么用。",2,5,382,6,64,21,19,2131,11,14,1,1,14,},
    [16] = {214,"牙刷","icon/awaken/214.png","琦玉的牙刷……",2,5,382,6,64,21,19,2141,11,14,1,1,14,},
    [17] = {221,"忍者手里剑","icon/awaken/221.png","忍者索尼克常用的暗器。",2,5,480,6,39,21,24,2211,11,14,1,1,14,},
    [18] = {222,"举重杠铃","icon/awaken/222.png","英雄协会考试用的杠铃。",2,5,480,6,39,21,24,2221,11,14,1,1,14,},
    [19] = {223,"乌冬面","icon/awaken/223.png","连半机械人杰诺斯都喜欢吃的乌冬面。",2,5,480,6,39,21,24,2231,11,14,1,1,14,},
    [20] = {224,"漫画书","icon/awaken/224.png","琦玉喜欢看的漫画书。",2,5,480,6,39,21,24,2241,11,14,1,1,14,},
    [21] = {231,"杰诺斯的行李","icon/awaken/231.png","杰诺斯搬家准备的行李。",2,5,426,6,53,21,21,2311,11,14,1,1,14,},
    [22] = {232,"拳击手套","icon/awaken/232.png","电灯拉绳怪人的手套。",2,5,426,6,53,21,21,2321,11,14,1,1,14,},
    [23] = {233,"综合训练器械","icon/awaken/233.png","背心尊者经常使用的训练器械。",2,5,426,6,53,21,21,2331,11,14,1,1,14,},
    [24] = {234,"琦玉的汤锅","icon/awaken/234.png","琦玉用来煮海带汤的锅……",2,5,426,6,53,21,21,2341,11,14,1,1,14,},
    [25] = {311,"杰诺斯装备箱","icon/awaken/311.png","里面装着杰诺斯的超级机械臂",3,5,549,6,92,21,27,3111,11,76,1,1,76,},
    [26] = {312,"琦玉的蛀牙","icon/awaken/312.png","被拳击怪人打掉的蛀牙……",3,5,549,6,92,21,27,3121,11,76,1,1,76,},
    [27] = {313,"琦玉的便当","icon/awaken/313.png","在便利店可以买到的便当。",3,5,549,6,92,21,27,3131,11,76,1,1,76,},
    [28] = {321,"闪电侠望远镜","icon/awaken/321.png","闪电侠用来观察敌人的望远镜。",3,5,690,6,56,21,34,3211,11,76,1,1,76,},
    [29] = {322,"囚犯大铁球","icon/awaken/322.png","监狱里的重刑犯会被锁上这个。",3,5,690,6,56,21,34,3221,11,76,1,1,76,},
    [30] = {323,"哑铃","icon/awaken/323.png","锻炼臂力用的哑铃。",3,5,690,6,56,21,34,3231,11,76,1,1,76,},
    [31] = {331,"警察对讲机","icon/awaken/331.png","警察的标准配备之一。",3,5,612,6,76,21,30,3311,11,76,1,1,76,},
    [32] = {332,"猪扒盖浇饭","icon/awaken/332.png","好吃的猪扒盖浇饭。",3,5,612,6,76,21,30,3321,11,76,1,1,76,},
    [33] = {333,"警察手枪","icon/awaken/333.png","从没打死过人……",3,5,612,6,76,21,30,3331,11,76,1,1,76,},
    [34] = {411,"睫毛夹","icon/awaken/411.png","吹雪组睫毛专用。",4,5,717,6,120,21,35,4111,11,344,1,1,344,},
    [35] = {412,"吹雪大衣","icon/awaken/412.png","吹雪穿的大衣。",4,5,717,6,120,21,35,4121,11,344,1,1,344,},
    [36] = {413,"PSP游戏机","icon/awaken/413.png","KING的游戏机。",4,5,717,6,120,21,35,4131,11,344,1,1,344,},
    [37] = {421,"吹雪组轿车","icon/awaken/421.png","吹雪组全体打工攒钱买的轿车。",4,5,900,6,74,21,45,4211,11,344,1,1,344,},
    [38] = {422,"啤酒杯","icon/awaken/422.png","黄金球喝酒的啤酒杯。",4,5,900,6,74,21,45,4221,11,344,1,1,344,},
    [39] = {423,"琦玉的假发","icon/awaken/423.png","琦玉乔装打扮用的假发。",4,5,900,6,74,21,45,4231,11,344,1,1,344,},
    [40] = {431,"飞船的大门","icon/awaken/431.png","宇宙飞船内部的门，被琦玉拉坏了。",4,5,798,6,99,21,39,4311,11,344,1,1,344,},
    [41] = {432,"预言信","icon/awaken/432.png","上面写着“地球要危险了”",4,5,798,6,99,21,39,4321,11,344,1,1,344,},
    [42] = {433,"索尼克发辫","icon/awaken/433.png","音速索尼克的发辫，与杰诺斯打斗时被切断了",4,5,798,6,99,21,39,4331,11,344,1,1,344,},
    [43] = {511,"劫匪的钱袋","icon/awaken/511.png","A级通缉犯牛牛抢劫银行后，装满的钱袋。",5,5,884,6,148,21,44,5111,11,1214,1,1,1214,},
    [44] = {512,"海王的皇冠","icon/awaken/512.png","深海之王的皇冠。",5,5,884,6,148,21,44,5121,11,1214,1,1,1214,},
    [45] = {513,"主持人麦克风","icon/awaken/513.png","服装大赛主持人用的麦克风。",5,5,884,6,148,21,44,5131,11,1214,1,1,1214,},
    [46] = {521,"笔记本电脑","icon/awaken/521.png","杰诺斯用的笔记本电脑。",5,5,1110,6,91,21,55,5211,11,1214,1,1,1214,},
    [47] = {522,"一叠钞票","icon/awaken/522.png","杰诺斯付给琦玉的房租。",5,5,1110,6,91,21,55,5221,11,1214,1,1,1214,},
    [48] = {523,"冲浪板","icon/awaken/523.png","海边冲浪美女的冲浪板。",5,5,1110,6,91,21,55,5231,11,1214,1,1,1214,},
    [49] = {531,"兔子布偶","icon/awaken/531.png","小女孩的兔子布偶。",5,5,984,6,123,21,49,5311,11,1214,1,1,1214,},
    [50] = {532,"空投降落伞 ","icon/awaken/532.png","飞机上丢下来的……",5,5,984,6,123,21,49,5321,11,1214,1,1,1214,},
    [51] = {533,"飞船炮弹","icon/awaken/533.png","外星飞船发射的大炮弹",5,5,984,6,123,21,49,5331,11,1214,1,1,1214,},
    [52] = {611,"心跳姐妹游戏盘","icon/awaken/611.png","KING最喜欢的游戏……",6,5,1051,6,176,21,52,6111,11,4914,1,1,4914,},
    [53] = {612,"游戏手柄","icon/awaken/612.png","KING的游戏机手柄……",6,5,1051,6,176,21,52,6121,11,4914,1,1,4914,},
    [54] = {613,"弯曲的汤勺","icon/awaken/613.png","被小龙卷用超能力弯曲的汤勺……",6,5,1051,6,176,21,52,6131,11,4914,1,1,4914,},
    [55] = {621,"寻猫启事","icon/awaken/621.png","小女孩发布的寻猫启事……",6,5,1320,6,108,21,66,6211,11,4914,1,1,4914,},
    [56] = {622,"丑女人面具","icon/awaken/622.png","童帝制造的丑女人面具，据说可以查看别人的实力。",6,5,1320,6,108,21,66,6221,11,4914,1,1,4914,},
    [57] = {623,"走失的猫咪","icon/awaken/623.png","小萝莉走失的猫咪。",6,5,1320,6,108,21,66,6231,11,4914,1,1,4914,},
    [58] = {631,"新型饮料","icon/awaken/631.png","贩卖机里出售的新型饮料。",6,5,1170,6,146,21,58,6311,11,4914,1,1,4914,},
    [59] = {632,"矿泉水","icon/awaken/632.png","好喝的矿泉水……",6,5,1170,6,146,21,58,6321,11,4914,1,1,4914,},
    [60] = {633,"参赛券","icon/awaken/633.png","比武大会参赛券。",6,5,1170,6,146,21,58,6331,11,4914,1,1,4914,},
    }
}

local __index_id = {
    [111] = 1,
    [112] = 2,
    [113] = 3,
    [114] = 4,
    [121] = 5,
    [122] = 6,
    [123] = 7,
    [124] = 8,
    [131] = 9,
    [132] = 10,
    [133] = 11,
    [134] = 12,
    [211] = 13,
    [212] = 14,
    [213] = 15,
    [214] = 16,
    [221] = 17,
    [222] = 18,
    [223] = 19,
    [224] = 20,
    [231] = 21,
    [232] = 22,
    [233] = 23,
    [234] = 24,
    [311] = 25,
    [312] = 26,
    [313] = 27,
    [321] = 28,
    [322] = 29,
    [323] = 30,
    [331] = 31,
    [332] = 32,
    [333] = 33,
    [411] = 34,
    [412] = 35,
    [413] = 36,
    [421] = 37,
    [422] = 38,
    [423] = 39,
    [431] = 40,
    [432] = 41,
    [433] = 42,
    [511] = 43,
    [512] = 44,
    [513] = 45,
    [521] = 46,
    [522] = 47,
    [523] = 48,
    [531] = 49,
    [532] = 50,
    [533] = 51,
    [611] = 52,
    [612] = 53,
    [613] = 54,
    [621] = 55,
    [622] = 56,
    [623] = 57,
    [631] = 58,
    [632] = 59,
    [633] = 60,
}

local __key_map = {
    id = 1,
    name = 2,
    icon = 3,
    comment = 4,
    quality = 5,
    str_type_1 = 6,
    str_value_1 = 7,
    str_type_2 = 8,
    str_value_2 = 9,
    str_type_3 = 10,
    str_value_3 = 11,
    compose_id = 12,
    price_type = 13,
    price = 14,
    is_drop = 15,
    gm = 16,
    relife_value = 17,
}

local m = {
    __index = function(t,k)
        if k == "toObject"then
            return function()
                local o = {}
                for key, v in pairs (__key_map) do
                    o[key] = t._raw[v]
                end
                return o
            end
        end

        assert(__key_map[k], "cannot find " .. k .. " in record_item_awaken_info")
        return t._raw[__key_map[k]]
    end
}

function item_awaken_info.getLength()
    return #item_awaken_info._data
end

function item_awaken_info.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

function item_awaken_info.indexOf(index)
    if index == nil then
        return nil
    end
    return setmetatable({_raw = item_awaken_info._data[index]}, m)
end

function item_awaken_info.get(id)
    local k = id
    return item_awaken_info.indexOf(__index_id[k])
end

function item_awaken_info.set(id, key, value)
    local record = item_awaken_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

function item_awaken_info.get_index_data()
    return __index_id
end

